{
    "-8b327v4ThI": {
        "speakers": [
            "Dan Holevoet"
        ],
        "summary": "Dan Holevoet, an engineer at Google, talks at the 2013 Game Developers Conference about building backends for mobile applications using Google Cloud Endpoints. Google Cloud Endpoints makes it easy to build OAuth 2-protected, RESTful APIs and instantly generate client libraries for Android, iOS, and JavaScript. See how you can use this feature to connect your Android, iOS, and mobile browser applications to powerful backends built on App Engine.",
        "viewCount": "36",
        "rating": 5,
        "title": "GDC 2013 - Connect Mobile Apps to the Cloud Without Breaking a Sweat",
        "id": "-8b327v4ThI"
    },
    "0g0oOOT86NY": {
        "speakers": [
            "Alex Komoroske",
            "Matthew McNulty"
        ],
        "summary": "This session builds on technologies and concepts discussed in a previous session, ''Web Components: a tectonic shift for web development''. This year web development gets a whole lot better thanks to the incredible power of Web Components. Our goal in this session is to show you how to use polyfills to help you realize tomorrow's web platform today. As browsers implement these new specifications, that shim layer gets smaller, better, and faster over time. We'll talk about shadow DOM, custom elements, declarative data/event binding, touch input, smooth animations, and how you can combine them to create awesome apps. Write less boilerplate, target every platform, and be more productive by using the next generation of the web platform. For all I/O 2013 sessions, go to https://developers.google.com/live'",
        "viewCount": "7733",
        "rating": 4.962963,
        "title": "Google I/O 2013 - Web Components in Action",
        "id": "0g0oOOT86NY"
    },
    "07HaQwxAo5s": {
        "speakers": [
            "Aaron Boodman"
        ],
        "summary": "Aaron Boodman, a software engineer at the Google Chrome Extensions team gives an overview of the design of the core extension system. Visit code.google.com/chrome/extensions for more information.",
        "viewCount": "8669",
        "rating": 4.902439,
        "title": "Google Chrome Extensions: Platform Design",
        "id": "07HaQwxAo5s"
    },
    "-wumTIhaKYc": {
        "speakers": [
            "Paul Kinlan",
            "Pete LePage"
        ],
        "summary": "Writing a web server in a web browser is a little meta, but it's one of the many new scenarios unlocked by the new APIs available in Chrome Apps!. Join Paul Kinlan and Pete LePage as they explore the networking APIs available to Chrome Apps. They'll show you how you you can write your own web server, and connect to other devices via the network. While the web server in a browser may not be a common scenario, accessing the TCP and UDP stack is extremely powerful and will allow your apps to connect to other hardware or services like never before.",
        "viewCount": "1919",
        "rating": 4.68,
        "title": "Chrome Apps Office Hours: Networking APIs",
        "id": "-wumTIhaKYc"
    },
    "055ekKZk7mc": {
        "speakers": [
            "Paul Lewis",
            "Peter Beverloo "
        ],
        "summary": "We used to develop websites solely for desktop users. Today, we also develop for mobile devices, and who knows what new form factors will follow tomorrow. How are you expected to cope with many different constraints, and what are the right ways for approaching device agnostic development?. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "1234",
        "rating": 5,
        "title": "Google I/O 2013 - Device Agnostic Development",
        "id": "055ekKZk7mc"
    },
    "-Gs1SPZnmrA": {
        "speakers": [
            "Boris Smus",
            "Pete LePage"
        ],
        "summary": "Are you building for the mobile web? Are you looking for easier and better tools to help you create great experiences? Join Boris Smus and Pete LePage as they show you some of the many tools available to mobile web developers. We'll take a look Chrome's remote debugging features, some of the emulation tools available to you within Chrome and take a deep dive into some of the advanced use cases of these tools to help you build for the mobile web.",
        "viewCount": "2019",
        "rating": 4.8,
        "title": "Mobile Chrome Office Hours: Tools for Mobile Web Development",
        "id": "-Gs1SPZnmrA"
    },
    "0HVJMIeb3aE": {
        "speakers": [
            "Arun Nagarajan",
            "John McGowan"
        ],
        "summary": "With the Google Drive SDK, developers can integrate custom ''Create'' and ''Open With'' menus within the Google Drive interface and reach tens of millions of users. Using Apps Script API in conjunction with the Google Drive SDK, developers can take advantage of the unique capabilities of Apps Script while also developing entirely on the Google Cloud! We will also demonstrate how you can get programmatic access to files and folders in Drive via Apps Script. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "383",
        "rating": 5,
        "title": "Google I/O 2013 - Integrate Google Drive with Google Apps Script",
        "id": "0HVJMIeb3aE"
    },
    "0hB9eXnGVLU": {
        "summary": "Chrome Apps Office Hours: System Info APIs",
        "viewCount": "797",
        "rating": 4.6666665,
        "title": "Chrome Apps Office Hours: System Info APIs",
        "id": "0hB9eXnGVLU"
    },
    "0G9OaTzdOa0": {
        "speakers": [
            "Akshay Kannan"
        ],
        "summary": "Use Google Cloud Print's API to send documents to a printer (or anywhere else) quickly and easily. We're currently integrated with Chrome, ChromeOS, mobile Gmail/Docs, and most new printers, and that's just the start. We provide a configurable JavaScript API, an Android Intent, as well as HTTP and XMPP interfaces for sending documents and receiving them in virtually any format. Come learn how to enable printing from your web and mobile apps on any device to any printer in the world, with just a few lines of code!. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "5083",
        "rating": 4.5555553,
        "title": "Google I/O 2012 - Beyond Paper: Google Cloud Print and the Future of Printing",
        "id": "0G9OaTzdOa0"
    },
    "10m03iyZ0dQ": {
        "speakers": [
            "Josh Sassoon",
            "Tom Broxton"
        ],
        "summary": "Design is different from art. In fact, if you had to use math to validate it, then you are probably on the right track. In this product design-focused session, we will discuss what it means to be a designer at YouTube. We will cover the state and meaning of the multi-device world we live in. Finally, we will share a few best principles for both design and corresponding quantitative analysis in this new world. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "689",
        "rating": 5,
        "title": "Google I/O 2013 - Designing Products for a Multi-screen World: The YouTube Perspective",
        "id": "10m03iyZ0dQ"
    },
    "0Jtni1m_3ZU": {
        "speakers": [
            "Christian Kurzke"
        ],
        "summary": "Google TV gives developers a consistent Android platform to create and deliver applications, games and high quality media on the largest screen in the house. In this session we'll show you how to unlock the potential of the current Google TV devices and explain the new features of the next generation Google TV platform. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "2479",
        "rating": 4.8,
        "title": "Google I/O 2013 - Android: As seen on TV!",
        "id": "0Jtni1m_3ZU"
    },
    "1rs9jj7fYxU": {
        "summary": "In this session, we discuss feedback on the Google Drive SDK documentation. We announce a new in-page feedback mechanism as well as other feedback channels like the Drive SDK Stack Overflow channel and blog comments. We clarify that there is no longer an installation requirement for apps that want access to the Drive API. Also, we demonstrate some of the marketing and distribution features included in a full Chrome Web Store integration, including up-selling from filtered lists of Drive apps that can open specific file types (MIME type filtering). To close, we highlight one of the tips in a recent post to the Google Apps Developer blog at http://googleappsdeveloper.blogspot.com/.",
        "viewCount": "1497",
        "rating": 4.6,
        "title": "Google Drive SDK Question Time",
        "id": "1rs9jj7fYxU"
    },
    "3-WYu_p5rdU": {
        "speakers": [
            "Shane O'Sullivan",
            "Rowan Beenje",
            "Pavel Feldman",
            "Chris Lord",
            "Matt Delaney"
        ],
        "summary": "How can we get faster repaints, more frames per second, quicker layout updates? Why are in-browser operations still perceptibly slower than native? And with page session time growing dramatically, are web developers worried enough about memory leaks and garbage collection?. Panelists: Shane O'Sullivan, Rowan Beenje, Pavel Feldman, Chris Lord. Moderator: Matt Delaney",
        "viewCount": "3346",
        "rating": 4.6363635,
        "title": "Edge Conference - Panel 3: Performance",
        "id": "3-WYu_p5rdU"
    },
    "2txPYQOWBtg": {
        "speakers": [
            "Dimitri Glazkov",
            "Alex Komoroske"
        ],
        "summary": "From embeds to widgets to managing complex applications, you constantly face the need for better componentization as a web developer. Many-a-lines of JavaScript have been written to alleviate this problem -- poorly. But help is on the way. The web platform is gaining a powerful new set of capabilities designed to better help you build robust, reusable, and packageable components. We'll cover what they do, their status, and how you can start playing with these powerful emerging technologies today. Most importantly, we'll show you how to get involved and help influence their direction as they mature. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "18937",
        "rating": 4.870968,
        "title": "Google I/O 2012 - The Web Platform's Cutting Edge",
        "id": "2txPYQOWBtg"
    },
    "1zvhs5FR0X8": {
        "speakers": [
            "Colton McAnlis",
            "Noel Allen"
        ],
        "summary": "In this talk, we will be porting an application to Native Client in 60 minutes, LIVE; showing the power of what Native Client can provide for traditional C++ developers looking to move to the web. In the porting process we'll cover specific tasks that a developer would need to perform during a port, and how to to address them with new tools and technologies including debugging integration with Visual Studio and a set of newly added utility libraries to the SDK. Attendees to this session will walk away with a clear understanding of what's required to port their applications to Native Client so that they can start their own projects. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "4011",
        "rating": 5,
        "title": "Google I/O 2012 - Native Client LIVE",
        "id": "1zvhs5FR0X8"
    },
    "30_AIEhar-I": {
        "speakers": [
            "Richard Rabbat",
            "Joshua Marantz",
            "Håkon Wium Lie"
        ],
        "summary": "mod_pagespeed is an Apache module that web developers can use to automate web page performance optimizations. In this talk, we examine how mod_pagespeed improves web page speed and reduces network bandwidth usage and describe the measured benefits on these pages. We then describe WebP, a new image format for the web, that reduces the bandwidth needs for images by 40% over JPEG for a comparable quality and demonstrate its support in Chrome and Opera.",
        "viewCount": "9456",
        "rating": 4.857143,
        "title": "Google I/O 2011: Make the Web Faster",
        "id": "30_AIEhar-I"
    },
    "3eHKebsEOns": {
        "summary": "Mobile Web Thursdays",
        "viewCount": "1895",
        "rating": 4.885714,
        "title": "Mobile Web Thursdays",
        "id": "3eHKebsEOns"
    },
    "3pxf3Ju2row": {
        "speakers": [
            "Sam Dutton",
            "Pavel Feldman"
        ],
        "summary": "Web app development moves fast and Chrome Developer Tools is still keeping you one step ahead. If you know your way around the Dev Tools and would like to take your skills to a higher level, this session will kick your productivity into overdrive. Since last year's installment, we've added a whole slew of features that empower developers to make rich web apps, so in this demo-rich session we'll explain how to use those tools to develop and debug on mobile and desktop. We'll take you jank hunting with the new timeline, delve into minified JavaScript via Source Maps, debug Web Workers, and much more. Join us and learn what Chrome Developer Tools can do for you. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "34239",
        "rating": 4.957143,
        "title": "Google I/O 2012 - Chrome Developer Tools Evolution",
        "id": "3pxf3Ju2row"
    },
    "4cIFRn0rp5s": {
        "speakers": [
            "Eric Bidelman",
            "Paul Kinlan",
            "Paul Lewis",
            "Pete LePage",
            "Renato Dias"
        ],
        "summary": "Join us next week as we take a deeper dive into the new storage APIs available to Chrome Packaged Apps. We've invited Eric Bidelman, author of the HTML5 File System API book to join Paul Kinlan, Paul Lewis, Pete LePage and Renato Dias for our weekly Chrome Apps Office Hours in which we will pick apart some of the sample Chrome Apps and explain how we've used the storage APIs and why we made the decisions we did.",
        "viewCount": "2625",
        "rating": 4.6190476,
        "title": "Chrome Apps Office Hours: Storage API Deep Dive",
        "id": "4cIFRn0rp5s"
    },
    "4EHKN1ywdb4": {
        "speakers": [
            "Seth Ladd",
            "Vijay Menon",
            "Anton Muhin"
        ],
        "summary": "We announce that binary builds of Chromium with Dart VM are now available. Seth Ladd hosts with two guests from the Dart team, Vijay Menon and Anton Muhin. Download Dartium at http://www.dartlang.org/dartium/. Learn more about Dart at http://dartlang.org.",
        "viewCount": "4770",
        "rating": 4.448276,
        "title": "Dartisans ep. 2: Chromium with Dart VM Announced!",
        "id": "4EHKN1ywdb4"
    },
    "4f2Zky_YyyQ": {
        "speakers": [
            "Reto Meier",
            "Michael Mahemoff"
        ],
        "summary": "Native apps or mobile web? It's often a hard choice when deciding where to invest your mobile development resources. While the mobile web continues to grow, native apps and App Stores are incredibly popular. We will present both perspectives in an app development smackdown.",
        "viewCount": "136211",
        "rating": 4.892857,
        "title": "Google I/O 2011: HTML5 versus Android: Apps or Web for Mobile Development?",
        "id": "4f2Zky_YyyQ"
    },
    "4kGeyMkhFdQ": {
        "speakers": [
            "Nick Baum"
        ],
        "summary": "Video Footage from the Google Chrome Extensions launch event on 12/09/09. Nick Baum, product manager for Google Chrome's extension system presents the gallery approval process, gives tips to extensions developers on how to make their extension successful and discusses the team's short term plans.",
        "viewCount": "7481",
        "rating": 5,
        "title": "Google Chrome Extensions: Launch Event (part 6)",
        "id": "4kGeyMkhFdQ"
    },
    "4mf_yNLlgic": {
        "speakers": [
            "Paul Irish"
        ],
        "summary": "Level up on the Javascript console in the Chrome DevTools. Look at XHR requests, learn console helper functions to monitor events or explore objects better. Paul Irish from the Chrome team gives you a rundown.",
        "viewCount": "60481",
        "rating": 4.9488273,
        "title": "Become a JavasScript Console Power-User",
        "id": "4mf_yNLlgic"
    },
    "4tu2SJfSalA": {
        "speakers": [
            "Ilya Grigorik",
            "Stephen Konig"
        ],
        "summary": "Slides from our presentation: http://bit.ly/webp-fast ﻿. WebP is a new image format which provides lossy and lossless compression of images, with significant byte savings: 30-80% smaller image files when compared to jpeg and png! Tune in to find out about the latest news, features, and the roadmap of WebP. We'll also talk cover some great case studies of WebP adoption, and take an in-depth look at how to author and deploy WebP in your own applications and web-sites!",
        "viewCount": "5749",
        "rating": 4.9183674,
        "title": "Faster, smaller and more beautiful web with WebP",
        "id": "4tu2SJfSalA"
    },
    "5KL_ccQwAuo": {
        "summary": "Join the Chrome Team as we talk about the new Text to Speech API in Chrome Apps",
        "viewCount": "2702",
        "rating": 4.6190476,
        "title": "Chrome Apps Office Hours: Text to Speech API",
        "id": "5KL_ccQwAuo"
    },
    "4W7c9g--yBY": {
        "speakers": [
            "Aaron Boodman",
            "Erik Kay"
        ],
        "summary": "Video Footage from the Google Chrome Extensions launch event on 12/09/09. Aaron Boodman and Erik Kay, technical leads for the Google Chrome extensions team discuss the UI surfaces of Google Chrome extensions and the team's content not chrome philosophy. They also highlight the smooth, frictionless install and uninstall process for Google Chrome's extensions system and present the team's initiatives in the space of security and performance.",
        "viewCount": "4293",
        "rating": 5,
        "title": "Google Chrome Extensions: Launch Event (part 4)",
        "id": "4W7c9g--yBY"
    },
    "5KlnlCq2M5Q": {
        "summary": "The Dart project includes a modern scalable language, libraries, and tools to help developers build large complex web applications. Watch this video to learn about the different parts of the Dart project and how it can help you be more productive building high performance web apps. Learn more at http://dartlang.org",
        "viewCount": "85575",
        "rating": 4.79,
        "title": "Introducing Dart",
        "id": "5KlnlCq2M5Q"
    },
    "5Od2SuL2igA": {
        "speakers": [
            "Ankit Jain"
        ],
        "summary": "As an Android application developer, your goal is to get your app discovered. Google Play's goal is to surface the most relevant content for Android users. In this session, we discuss best practices for app creators in view of both goals. We will demonstrate, through concrete examples, best practices to help your application rise above others in the Google Play Store. We will discuss the signals that go into creating the top and trending lists, personalized recommendations, and Google Play Search. Come hear the inside story from the person who leads search & discovery on Google Play. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "1356",
        "rating": 5,
        "title": "Google I/O 2013 - Getting Discovered on Google Play",
        "id": "5Od2SuL2igA"
    },
    "6_oO9Gwf_do": {
        "speakers": [
            "Danny Hermes",
            "Ido Green"
        ],
        "summary": "Ready to rock the world with your next application? Odds are you are thinking about mobile, web and the cloud. In this session we will walk through building a modern mobile web application that takes advantage of the Google Cloud Platform. Learn trips, best practices and solid architecture that will make your next mobile web app an amazing success. Check out the slides at:. https://picturesque-app.appspot.com/slides. and feel free to play around with the demo application:. https://picturesque-app.appspot.com. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "1021",
        "rating": 4.75,
        "title": "Google I/O 2013 - Mobile, Web and Cloud - The Triple Crown of Modern Applications",
        "id": "6_oO9Gwf_do"
    },
    "5RFjOec-TI0": {
        "speakers": [
            "David Sehr"
        ],
        "summary": "Since 2011, NativeClient (NaCl) has been a feature of Chrome available through the Chrome Web Store. PNaCl is the next exciting step for this technology. It continues Native Client's compatibility with developers' existing codebases and near native-code performance, but brings this to the open web in a truly portable fashion. The technology is built around the open source LLVM compiler infrastructure. This technology enables application developers to build both web and Chrome Web Store applications that work on Windows, OS X, Linux, and ChromeOS for x86 and ARM. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "958",
        "rating": 5,
        "title": "Google I/O 2013 - Introduction to Portable Native Client (PNaCl)",
        "id": "5RFjOec-TI0"
    },
    "6dfrfRl6il8": {
        "speakers": [
            "Rachel Shearer"
        ],
        "summary": "Rachel Shearer an engineer from Google's Accessibility Engineering team discusses how developers can incorporate accessibility best practices when designing their extensions. Rachel also presents ChromeVis, an extension she created for users with low vision. You can find more information on ChromeVis at: https://chrome.google.com/extensions/detail/halnfobaneppemjnonmmhngbfifnafgd  To learn about accessibility best practices for extensions please review our guide at: http://code.google.com/chrome/extensions/a11y.html",
        "viewCount": "41292",
        "rating": 4.952381,
        "title": "Google Chrome Extensions and Accessibility",
        "id": "6dfrfRl6il8"
    },
    "6EJ801el-I8": {
        "summary": "For years we built web apps that far outpaced the capabilities of the browsers they ran in. Just as the browsers were catching up HTML5 came on the scene - video and audio, canvas, SVG, app cache, localStorage, @font-face, and more. Now the browsers are racing to stay ahead of the wave that's building as developers adopt these new capabilities. Is your HTML5 app going to ride the wave or be dashed on the rocks leaving users stranded? Learn which HTML5 features to seek out and which to avoid when it comes to building fast HTML5 web apps. This session will be live captioned.",
        "viewCount": "25085",
        "rating": 4.9255815,
        "title": "Google I/O 2012 - High Performance HTML5",
        "id": "6EJ801el-I8"
    },
    "6hIEqUhZ1A4": {
        "speakers": [
            "Paul Irish",
            "Alex Komoroske",
            "Louis Gray"
        ],
        "summary": "Google's creation of Blink brings a new rendering engine to the browser world. Paul Irish and Alex Komoroske, two members of the Chrome team, talk about new advances made possible from the change, and what consumers, developers and the Web can expect. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "875",
        "rating": 5,
        "title": "Google Developers Live at I/O 2013 - Blink and Your Browser",
        "id": "6hIEqUhZ1A4"
    },
    "6uCAdQSHhmA": {
        "speakers": [
            "Joshua Marantz"
        ],
        "summary": "mod_pagespeed is an open-source Apache module that automatically optimizes web pages and resources on them: images, CSS, JavaScript, and much more. In this episode, we'll catch up with Joshua Marantz, the tech lead of the project at Google and talk about the history of mod_pagespeed, its fast growing adoption (130K+ sites!), technical architecture and how it works under the hood. Finally, we'll talk about the upcoming 1.0 release milestone for the project. If you're curious about mod_pagespeed, then this is definitely the show you won't want to miss!",
        "viewCount": "39180",
        "rating": 4.984556,
        "title": "Make the Web Fast: Automagic site optimization with mod_pagespeed 1.0!",
        "id": "6uCAdQSHhmA"
    },
    "6Nb65wOWoT8": {
        "summary": "You learned about Chrome Apps at Google I/O, well now's your opportunity to learn more. We'll do a short recap of Chrome Apps and what they can do, and then answer your questions!",
        "viewCount": "2400",
        "rating": 4.7391305,
        "title": "Chrome Apps: Office Hours",
        "id": "6Nb65wOWoT8"
    },
    "6v4_SQas7XI": {
        "summary": "Demo Fest",
        "viewCount": "1835",
        "rating": 4.68,
        "title": "Chrome Apps Office Hours: Demo Fest",
        "id": "6v4_SQas7XI"
    },
    "6OLE9sZjUoI": {
        "speakers": [
            "Ido Green"
        ],
        "summary": "Part of our weekly show for Google Israeli developers, partners, cool startups and HTML5!. This week we will dive into the world of 'web workers' and interesting cases like: http://greenido.wordpress.com/2012/05/20/web-workers-and-big-data-a-real-world-example/",
        "viewCount": "1326",
        "rating": 3.5454545,
        "title": "HTML5 and Web Workers (GDL Israel)",
        "id": "6OLE9sZjUoI"
    },
    "7aHdg1IYUg0": {
        "speakers": [
            "Ilya Grigorik﻿"
        ],
        "summary": "Google Web Developer Advocate Ilya Grigorik﻿ after his presentation at the Devoxx conference in Antwerp. Discusses performance of front ends.",
        "viewCount": "1645",
        "rating": 5,
        "title": "Devoxx 2012: Front End Performance",
        "id": "7aHdg1IYUg0"
    },
    "7bJ-D1xXEeg": {
        "speakers": [
            "Colt McAnlis"
        ],
        "summary": "(Pre-recorded GDC content). Tired of fighting to fit your textures on disk? Too many bad reviews on long download times? Fix it! Don't settle for putting your raw DXT files in a ZIP, instead, compress your DXT textures by an extra 50%-70%! This talk will cover various ways to increase the compression of your game textures to allow for smaller distributables without introducing error, and allowing for fast on-demand decompression at run time. We'll cover how to losslessly squeeze your data with Huffman, block expansion, vector quantization, and we'll even take a look at what MegaTexture is doing too. If you've ever fought to fit textures into memory, this is the talk for you.",
        "viewCount": "5508",
        "rating": 4.873016,
        "title": "GDC 2012: DXT is NOT ENOUGH! Advanced texture compression for games",
        "id": "7bJ-D1xXEeg"
    },
    "7lXWt2L_1qU": {
        "speakers": [
            "Andrew Bowers",
            "Chris Lyon"
        ],
        "summary": "The introduction of the Chromebook Pixel has brought Chrome OS to highest quality hardware, including a 3:2 touchscreen, built in optional LTE, and the highest pixel density in the industry. Andrew Bowers and Chris Lyon talk about the development of the Pixel and what it means for Chrome OS. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "1828",
        "rating": 4.902439,
        "title": "Google Developers Live at I/O 2013 - The Chromebook Pixel",
        "id": "7lXWt2L_1qU"
    },
    "7lDQhxZII6c": {
        "speakers": [
            "Paul Kinlan",
            "Alex Komoroske"
        ],
        "summary": "A bi-weekly show about Web Intents (http://webintents.org/) hosted by Paul Kinlan with Special Guest Alex Komoroske. This week we will give an introduction to the project, a round up of interesting things that has happened in the last two weeks and also answer audience questions.",
        "viewCount": "1129",
        "rating": 4.5789475,
        "title": "Web Intents Wednesdays",
        "id": "7lDQhxZII6c"
    },
    "7os4DImjK5U": {
        "summary": "We interviewed Rovio, the makers of Angry Birds, at the Google I/O Sandbox on May 11, 2011 and they explained to us the benefits of building on Chrome. Angry Birds, one of the most popular games for mobile devices, is now available on Chrome!  For more information about developing on Chrome, visit: http://code.google.com/chrome/  For more information on Rovio, visit: http://www.rovio.com/",
        "viewCount": "11272",
        "rating": 4.230769,
        "title": "Google I/O Sandbox Case Study: Angry Birds",
        "id": "7os4DImjK5U"
    },
    "7sad-UGSOXE": {
        "summary": "An quick overview about how to debug WebGL applications.",
        "viewCount": "6125",
        "rating": 4.9444447,
        "title": "WebGL Debugging",
        "id": "7sad-UGSOXE"
    },
    "8b0LCBx8Rys": {
        "speakers": [
            "Paul Kinlan",
            "Paul Lewis"
        ],
        "summary": "Web Intents are the core mechanism for building interconnected apps on the Chrome platform. Join Paul Kinlan and Paul Lewis as we show you how to build client apps that send data to other web apps, and a service app that will receive input from any intent invocation.",
        "viewCount": "2730",
        "rating": 4.714286,
        "title": "Chrome Apps Office Hours: Building Apps with Web Intents",
        "id": "8b0LCBx8Rys"
    },
    "8uAYE5G1gSs": {
        "speakers": [
            "Colt McAnlis",
            "Grace Kloba"
        ],
        "summary": "Chrome implements fast, powerful webpage rendering by using the graphics hardware (GPU). But powerful GPU rendering introduces a new suite of issues that web developers need to understand. For example, how often is the texture cache invalidated? How can using translate-z cause GPU performance issues? How do hidden divs affect the GPU compositing process? Attendees will walk away with a clear understanding of the GPU compositor in Chrome and knowledge of how their design choices will impact a page's performance on devices with GPU compositing. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "1497",
        "rating": 5,
        "title": "Google I/O 2013 - Web Page Design with the GPU in Mind",
        "id": "8uAYE5G1gSs"
    },
    "8yfCQtx_nIE": {
        "speakers": [
            "Paul Irish",
            "Michael Deal"
        ],
        "summary": "Using the latest open web technologies, the developers creating some of the most inspired Chrome Experiments showcase their latest web experiments and discuss how they are making the web faster, more fun, and more open in this 3-episode hangout. Happy experimenting. Host: Paul Irish, Developer Advocate, Chrome. Guest: Michael Deal",
        "viewCount": "3017",
        "rating": 4.8974357,
        "title": "GDL Presents: Make Web Magic | Part I",
        "id": "8yfCQtx_nIE"
    },
    "9M9sNheYGIw": {
        "speakers": [
            "Jonas Sicking",
            "Charles McCathieNevile",
            "Ian Fette",
            "Mike Schroepfer"
        ],
        "summary": "Google I/O 2009 - Browser Perspectives: An Open Discussion. Jonas Sicking, Charles McCathieNevile, Ian Fette, Mike Schroepfer. Web developers are asking more from today's browsers — more speed, more functionality, and more ability to make web applications that make users happy. To talk about how browser development happens with respect to new standards, such as what influences decisions around which new APIs to implement first and how to implement new features in the face of still-changing standards proposals, we have a series of representatives from Google, Microsoft, Mozilla, and Opera taking part in a panel discussion moderated by Mike Schroepfer, VP of Engineering at Facebook.  For presentation slides and all I/O sessions, please go to: code.google.com/events/io/sessions.html",
        "viewCount": "4104",
        "rating": 4.368421,
        "title": "Google I/O 2009 - Browser Perspectives: An Open Discussion",
        "id": "9M9sNheYGIw"
    },
    "9pmPa_KxsAM": {
        "summary": "Google I/O keynote. To check out, 'Here's to your imagination,' the opening video to the conference, visit http://www.youtube.com/watch?v=Dr3STRBtTp0. Brought to you by Google Developers Live developers.google.com/live.",
        "viewCount": "579510",
        "rating": 4.8612275,
        "title": "Google I/O 2013: Keynote",
        "id": "9pmPa_KxsAM"
    },
    "9QSklqthit0": {
        "speakers": [
            "Join Joe Marini",
            "Pete LePage"
        ],
        "summary": "Join Joe Marini and Pete LePage as they take a look into the Media Galleries API, which provides Chrome Packaged App developers with the tools they need to be media-aware applications.",
        "viewCount": "940",
        "rating": 4,
        "title": "Chrome Apps Office Hours—The Media Galleries API",
        "id": "9QSklqthit0"
    },
    "9ZcAsZq468Y": {
        "speakers": [
            "Paul Kinlan"
        ],
        "summary": "Join host Paul Kinlan and the creators of Chrome Web Lab in the studio, as they dive into the technology and design behind Teleporter. Discover the magic and learn about the science behind this experiment: http://www.chromeweblab.com/en-GB/",
        "viewCount": "1293",
        "rating": 5,
        "title": "GDL Presents Push the Limits: Chrome Web Lab, Teleporter",
        "id": "9ZcAsZq468Y"
    },
    "_o-UX44iyj0": {
        "summary": "Synchronized File System",
        "viewCount": "839",
        "rating": 4.7777777,
        "title": "Chrome Apps Office Hours: Synchronized File System",
        "id": "_o-UX44iyj0"
    },
    "alG-UwRWV_U": {
        "speakers": [
            "John Mellor",
            "Pete LePage"
        ],
        "summary": "Almost every new mobile device today ships with a high DPI screen. That trend has started branching out to laptops, and it's only a matter of time until every device we use is high DPI. In this talk we'll dive into what high DPI means and how you can optimize your sites so they look great in any form factor. You'll learn 1) how different 'pixels' affect layout and how to achieve the layout you want, 2) how layouts are affected by different display densities, and 3) how different image formats can be used to provide the best experience for users ensuring that your site looks great on any device. You'll walk away knowing how to use responsive techniques to build sites that shine, and also how you can quickly update your existing sites to look beautiful, both today and in the future. Slides at http://goo.gl/j5Z5W. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "1269",
        "rating": 5,
        "title": "Google I/O 2013 - Seeing the World Through High DPI",
        "id": "alG-UwRWV_U"
    },
    "A0Z0ybTCHKs": {
        "speakers": [
            "Darin Fisher"
        ],
        "summary": "Chromium's multi-process architecture is a radical departure from other web browsers. There are many advantages to this design, but with it comes complexity. Darin Fisher gives an overview of how the processes communicate and then dives into specific examples like how optimized scrolling works. This video is a 'must see' for any Chromium developer.",
        "viewCount": "9322",
        "rating": 5,
        "title": "Chromium's multi-process architecture",
        "id": "A0Z0ybTCHKs"
    },
    "_O3-20FUJbg": {
        "summary": "In this episode, the AngularJS team joins us to talk about how they used Angular to build TextDrive. TextDrive is an open source text editor application that demonstrates of the power and simplicity of AngularJS and Chrome Apps. It features integration with Google Drive, web intents, and Ace (ace.ajax.org) in a simple and clean interface built upon HTML5 and web standards. To learn more visit https://github.com/GoogleChrome/textdrive-app",
        "viewCount": "5254",
        "rating": 5,
        "title": "Chrome Apps Office Hours: TextDrive and AngularJS",
        "id": "_O3-20FUJbg"
    },
    "anSdHAFLOPM": {
        "speakers": [
            "Paul Irish",
            "Pavel Feldman",
            "Sam Dutton",
            "Peter Beverloo",
            "Alex Sexton",
            "Paul Lewis"
        ],
        "summary": "Learn about the Chrome Developer Tools with Paul Irish, Pavel Feldman, Sam Dutton, Peter Beverloo, Alex Sexton and Paul Lewis.",
        "viewCount": "6874",
        "rating": 4.804878,
        "title": "+Chrome Developers Hangout: Dev Tools",
        "id": "anSdHAFLOPM"
    },
    "as0QBkGwp8Y": {
        "speakers": [
            "Jonathan Beri",
            "Ridhima Kedia"
        ],
        "summary": "Whether you have a website, mobile app, game, or other online service, users can now sign in with Google and bring along their Google+ profile. Come learn how Google+ Sign-In can create more engaging experiences in your app and drive more usage across devices. This talk will introduce the technical concepts of integrating Google+ Sign-In and other Google+ features, and is a pre-requisite for other Google+ talks. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "97",
        "title": "Google I/O 2013 - An Introduction to Integrating Google+ Sign-In",
        "id": "as0QBkGwp8Y"
    },
    "ATJjbFkxRcc": {
        "speakers": [
            "Avi Muchnik"
        ],
        "summary": "Avi Muchnik, CEO and Co-founder of Aviary (www.aviary.com) discusses his company's experience with the Google Chrome extensions platform.  To learn more on creating Google Chrome Extensions please visit code.google.com/chrome/extensions or chek out the gallery at chrome.google.com/extensions.",
        "viewCount": "5969",
        "rating": 5,
        "title": "Google Chrome Extensions Developer Snapshots - Aviary",
        "id": "ATJjbFkxRcc"
    },
    "AusOPz8Ww80": {
        "speakers": [
            "Matthew Papakipos"
        ],
        "summary": "Google I/O 2009 - Google's HTML 5 Work: What's Next?  Matthew Papakipos  Learn about new features in HTML 5 that enhance and enrich the web experience. Learn about new features in HTML 5, how they'll be supported in Chrome, and our latest plans for new functionality. The web browser is quickly evolving into a rich platform with access to all the capabilities that your computer has to offer. This talk will help you understand what is possible and how to write applications that use the latest APIs.  For presentation slides and all I/O sessions, please go to: code.google.com/events/io/sessions.html",
        "viewCount": "92249",
        "rating": 4.724138,
        "title": "Google I/O 2009 - Google's HTML 5 Work: What's Next?",
        "id": "AusOPz8Ww80"
    },
    "ayhDAWp16eg": {
        "summary": "This week it's all about webmasters and snippets on the Google+ Platform Office Hours. Snippets! With the history API in developer preview, creating great snippets on your website is more important than ever. Join us as we explain snippets and review what's new. 0:27 - Introducing Gus. 1:20 - What is a snippet?. 3:29 - As a content producer why do I care about snippets?  - (Sorry about the missing audio) - Because you, as the content producer know how your content should be displayed elsewhere on the web. Snippets give you control over it. 4:30 - How do I add snippets to my site?. 5:59 - The snippet code generator tool: https://developers.google.com/+/plugins/snippet/. 7:43 - Can you use an external site to host images?.  - (More missing audio) - Yup! You can include them cross domain, for example if you use a content distribution network, but only include URLs you control. 9:38 - schema.org and its many schemas. 12:46 - Snippets on the Google+ history API. 15:20 - How do you verify schema.org markup?. - Rich Snippet Testing Tool: http://www.google.com/webmasters/tools/richsnippets. - MicroBeta Chrome Extension: http://goo.gl/EPwYS",
        "viewCount": "2513",
        "rating": 4.111111,
        "title": "Google+ Platform Office Hours: Snippets",
        "id": "ayhDAWp16eg"
    },
    "aZJnI6hxr-c": {
        "speakers": [
            "Brendan Kenny"
        ],
        "summary": "Much if not most of the world's data has a geographic component. Data visualizations with a geographic component are some of the most popular on the web. This session will explore the principles of data visualization and how you can use HTML5 - particularly WebGL - to supplement Google Maps visualizations. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "323",
        "rating": 5,
        "title": "Google I/O 2013 - Google Maps + HTML5 + Spatial Data Visualization: A Love Story",
        "id": "aZJnI6hxr-c"
    },
    "az3CSG3mzBw": {
        "speakers": [
            "Ardan Arac",
            "John Hjelmstad"
        ],
        "summary": "In this session we'll walk you through a series of techniques you can use to make your app and content shine on Google. Using these techniques you can connect more directly with new and existing users on Google Search. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "71",
        "rating": 5,
        "title": "Google I/O 2013 - G+ and Search: How to Enhance Your Brand Queries on Google",
        "id": "az3CSG3mzBw"
    },
    "B2fFFGHkz_A": {
        "speakers": [
            "Ido Green"
        ],
        "summary": "Mobile Web apps: State of mobile web, design, building and some tips and tricks. This is part of Google Developer Live Israel weekly show (every WED 14:00 Israel time). You can follow up with the slide from: http://ido-green.appspot.com/mobile_web_app_3_2013/index.html",
        "viewCount": "1416",
        "rating": 4.891892,
        "title": "Mobile Web Apps (GDL-IL)",
        "id": "B2fFFGHkz_A"
    },
    "B4M_a7xejYI": {
        "speakers": [
            "Matt Perry"
        ],
        "summary": "Matt Perry, a software engineer at Google discusses how the different components of Google Chrome extensions communicate with each other. To get more information, visit code.google.com/chrome/extensions",
        "viewCount": "28399",
        "rating": 4.8,
        "title": "Google Chrome Extensions: Extension Message Passing",
        "id": "B4M_a7xejYI"
    },
    "bmxr75CV36A": {
        "speakers": [
            "Rafael Weinstein"
        ],
        "summary": "Rafael Weinstein, a software engineer at Google presents information about the design of the APIs that developers will use in creating a Google Chrome extension. Learn more at code.google.com/chrome/extensions",
        "viewCount": "33306",
        "rating": 4.7674417,
        "title": "Google Chrome Extensions: Extension API Design",
        "id": "bmxr75CV36A"
    },
    "bM8td99ZJ6k": {
        "speakers": [
            "Jean Wang"
        ],
        "summary": "Lightning talk by Jean Wang, Hardware Lead for Google Glass, sharing project experiences and insights, at 7 Techmakers and a Microphone at Google I/O presented by Women Techmakers.",
        "viewCount": "308",
        "rating": 5,
        "title": "Google I/O 2013 - Jean Wang - 7 Techmakers and a Microphone",
        "id": "bM8td99ZJ6k"
    },
    "BaneWEqNcpE": {
        "summary": "Your browser is one of the most and best instrumented development platforms -- you may just not realize it yet. In this episode we'll take a whirlwind tour of how to analyze network performance, rendering and layout pipeline, as well as detecting memory leaks in your JavaScript code, and using audits and extensions to build faster and better apps!",
        "viewCount": "19766",
        "rating": 4.9726963,
        "title": "Wait, Chrome Dev Tools could do THAT?",
        "id": "BaneWEqNcpE"
    },
    "bsGgfUreyZw": {
        "speakers": [
            "Lars Bak",
            "Kasper Lund"
        ],
        "summary": "The two creators of Dart will discuss the rationale behind Dart's design and its impact on web scalability and performance. They'll also present how Dart helps developers innovate by increasing their productivity without breaking backwards compatibility. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "25580",
        "rating": 4.8139534,
        "title": "Google I/O 2012 - Dart - A Modern Web Language",
        "id": "bsGgfUreyZw"
    },
    "bnK3XKOVgwQ": {
        "summary": "Is the light on? Is the camera pointed in the right direction?",
        "viewCount": "4285",
        "rating": 4.878788,
        "title": "+Chrome Developer: WebGL Hangout",
        "id": "bnK3XKOVgwQ"
    },
    "bv6eVTlfRcM": {
        "speakers": [
            "Avnish Bhatnagar",
            "Sean Maday"
        ],
        "summary": "Google Maps Engine (GME) Portable enables organizations to 'cut' their 2D and 3D data from GME for use offline. This capability extends the power of Google Maps and Google Earth into austere environments where network access may be limited or unavailable. Portable comes with a full suite of APIs that allow developers to embed Google's familiar mapping interfaces into their own offline applications. Portable is currently in use on the International Space Station, it has been aloft in aircraft, underwater in submarines, and used almost everywhere in between. We are excited to get Portable out to a wider developer audience, so talented engineers can create new and exciting offline implementations. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "1119",
        "rating": 5,
        "title": "Google I/O 2013 - Off the Grid: Going Offline with Maps and Earth",
        "id": "bv6eVTlfRcM"
    },
    "BZeQETah684": {
        "speakers": [
            "Erik Kay"
        ],
        "summary": "Erik Kay, an engineer at Google, provides more information about the UI of Google Chrome's extension system. For more information visit code.google.com/chrome/extensions.",
        "viewCount": "40045",
        "rating": 4.6581197,
        "title": "Google Chrome Extensions: UI Design",
        "id": "BZeQETah684"
    },
    "bwOhfoewMYs": {
        "speakers": [
            "Alex Danilo"
        ],
        "summary": "Innovative new features such as CSS Regions, Exclusions, Shaders, Compositing, and the Shadow DOM bring powerful capabilities to modern browsers. See demos and code and learn about the status of these new standards. Get an early look at the development workflow enabled by Adobe Shadow and learn about the open source project 'Brackets', which is working to create a code editor for the web built entirely with web technologies. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "17122",
        "rating": 4.929412,
        "title": "Google I/O 2012 - New Web Tools and Advanced CSS/HTML5 Features from Adobe & Google",
        "id": "bwOhfoewMYs"
    },
    "BvsdgU9Covo": {
        "speakers": [
            "Nissim Betito"
        ],
        "summary": "This week with hosted Nissim Betito and we spoke about ChromeOS and how to hack it for developers. We show some powerful tools that let you develop on Chromebook and (of course) show how to install other OS on ChromeOS hardware.",
        "viewCount": "786",
        "rating": 5,
        "title": "GDL-Israel on ChromeOS for Developers",
        "id": "BvsdgU9Covo"
    },
    "C92vNyLbwn4": {
        "speakers": [
            "Anna Patterson"
        ],
        "summary": "Lightning talk by Anna Patterson, VP of Engineering in the areas of Search and Artificial Intelligence at Google, at 7 Techmakers and a Microphone at Google I/O presented by Women Techmakers.",
        "viewCount": "133",
        "rating": 5,
        "title": "Google I/O 2013 - Anna Patterson - 7 Techmakers and a Microphone",
        "id": "C92vNyLbwn4"
    },
    "Bzw8-ZLpwtw": {
        "speakers": [
            "Bryan McQuade",
            "Doantam Phan",
            "Mona Vajolahi"
        ],
        "summary": "Users expect a fast and optimized experience regardless of whether they're on a mobile or desktop browser. However, delivering a fast mobile experience requires careful consideration and engineering: you need to optimize your network access, you need to prioritize critical assets to deliver the best visual rendering performance, and you need to adapt your pages to the capabilities of the device (such as smaller viewport, touch, high-resolution screens, etc.). In this session we will take a deep technical dive into the criteria that affect the performance of your sites on mobile browsers, and discuss how you can optimize your site to deliver the best experience to your users. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "1857",
        "rating": 5,
        "title": "Google I/O 2013 - Instant Mobile Websites: Techniques and Best Practices",
        "id": "Bzw8-ZLpwtw"
    },
    "dAhhniqwkp8": {
        "speakers": [
            "Sam Dutton"
        ],
        "summary": "WebRTC is an open project that enables web browsers with real-time communications capabilities via simple JavaScript APIs.",
        "viewCount": "5289",
        "rating": 4.9130435,
        "title": "An Introduction to WebRTC",
        "id": "dAhhniqwkp8"
    },
    "CzmNbmwDMUs": {
        "speakers": [
            "Andrew Wales",
            "Nick Mihailovski",
            "Pete Frisella"
        ],
        "summary": "Google Analytics recently launched Universal Analytics, a new way to measure user interactions across any device / platform / environment. By measuring this data, developers can better optimize their applications. In this session we'll discuss how how to measure user-interaction from any device as well as demo new reports and best practices to optimize both web and mobile apps. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "1487",
        "rating": 5,
        "title": "Google I/O 2013 - Optimize Web and Mobile Apps, Across Devices, Using Google Analytics",
        "id": "CzmNbmwDMUs"
    },
    "cervjrVRLjA": {
        "speakers": [
            "Renato Mangini",
            "Pete LePage"
        ],
        "summary": "Join Renato Mangini and Pete LePage as we discuss the WebView, a HTML tag that provides Chrome packaged app developers a way to insert a safe and controlled 'browser in an element' DOM node. Learn the differences between the WebView and the Sandboxed pages, the WebView's automation API and some suggested use cases.",
        "viewCount": "1541",
        "rating": 4.826087,
        "title": "Chrome Apps Office Hours - the WebView Control",
        "id": "cervjrVRLjA"
    },
    "d3kfEeMZ65c": {
        "speakers": [
            "Glenn Kasten",
            "Ian Ni-Lewis",
            "Raph Levien"
        ],
        "summary": "It's not that hard to play a background soundtrack in your mobile game app, or to play short clips of sound in response to user actions. But how about responsive reliable audio, that doesn't glitch, works well across a range of devices, and doesn't eat up your user's battery? Oh, and is lower latency too? It turns out that's not so easy. We'll share our own experiences with the Android platform and apps, discuss the problem areas and the work we've been doing in the platform, and give some techniques you can apply now in your own apps. We assume you're familiar with OpenSL ES and audio terminology. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "5925",
        "rating": 4.896104,
        "title": "Google I/O 2013 - High Performance Audio",
        "id": "d3kfEeMZ65c"
    },
    "dASOm88Wh8g": {
        "speakers": [
            "Ilya Grigorik"
        ],
        "summary": "Building great, responsive mobile web applications means you have to be friends with the radio! We will cover how to build battery efficient mobile applications, how to get the best throughput, and how to plan for the various latency delays present in mobile networks. This talk is a radio crash course - aka, your HAM license for the mobile web - with a top-down overview of how a modern 4G carrier network works under the hood. Bring your propeller hat!. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "864",
        "rating": 4.851852,
        "title": "Google I/O 2013 - Mobile Performance from the Radio Up: Battery, Latency and Bandwidth Optimization",
        "id": "dASOm88Wh8g"
    },
    "dAp-l3gUcPY": {
        "speakers": [
            "Colt McAnlis"
        ],
        "summary": "How gaming got its groove back. Starring Colt McAnlis",
        "viewCount": "2080",
        "rating": 4.878788,
        "title": "Webify Your Game",
        "id": "dAp-l3gUcPY"
    },
    "DO-nzPqhdXw": {
        "speakers": [
            "Adam Barth"
        ],
        "summary": "Adam Barth, a researcher working on the extensions system for Google Chrome, discusses how the extension system makes it easier for developers to create secure extensions. Google Chrome's extension security architecture is based on two principles: least privilege and privilege separation. Both of these principles limit the amount of privileges an attacker has access to if they are able to find a vulnerability in an existing extension. Visit code.google.com/chrome/extensions for more information",
        "viewCount": "11522",
        "rating": 4.7777777,
        "title": "Google Chrome Extensions: Security",
        "id": "DO-nzPqhdXw"
    },
    "DujfpXOKUp8": {
        "speakers": [
            "Boris Smus",
            "Rick Byers"
        ],
        "summary": "PCs, laptops, tablets, smartphones, hybrids, televisions and more: touch-AND-mouse-enabled devices are coming. Come to this talk to learn how to make your site awesome on the growing number of touchscreen devices and to see what the future of the web holds for touch-based computing. You will learn how to future-proof your website for touchscreen laptops, how to build a buttery smooth touch experience, and, most importantly, how to create code that is responsive to multi-modal input. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "3111",
        "rating": 4.9452057,
        "title": "Google I/O 2013 - Point, Click, Tap, Touch - Building Multi-Device Web Interfaces",
        "id": "DujfpXOKUp8"
    },
    "dRwzmoDZtZM": {
        "speakers": [
            "Paul Irish"
        ],
        "summary": "Learn how you can use Chrome DevTools against a page running on your Android device. Chrome DevTools is just as powerful for the mobile web as it is for the desktop web. Notable sections:. 0:50 - Using Timeline. 2:51 - Show Paint Rectangles and Composited Layer Borders. 5:10 - Cause of Forced Layout. 8:05 - about:tracing. 11:00 - continuous page repainting mode. 16:20 - Enabling remote debugging with Chrome DevTools",
        "viewCount": "2202",
        "rating": 4.878788,
        "title": "The Breakpoint Ep. 7: Profiling a mobile site with Chrome DevTools and Android",
        "id": "dRwzmoDZtZM"
    },
    "dOcGW95oyL0": {
        "speakers": [
            "Ilya Grigorik"
        ],
        "summary": "PageSpeed Service enables site owners to speed up how quickly pages load for their users. https://developers.google.com/speed/pagespeed/service",
        "viewCount": "28081",
        "rating": 4.9069767,
        "title": "Introducing PageSpeed Service from Google",
        "id": "dOcGW95oyL0"
    },
    "e1FCrmGQwv4": {
        "summary": "WeVideo shows off an HTML5 version of their WeVideo video editor on a Chromebook Pixel.",
        "viewCount": "719",
        "rating": 5,
        "title": "Video editing on a Pixel with WeVideo",
        "id": "e1FCrmGQwv4"
    },
    "e0W2szZ2qhg": {
        "speakers": [
            "Joe Marini"
        ],
        "summary": "Chrome packaged apps expand the opportunities for Web developers, giving you the ability to run offline by default, to provide an immersive UX that runs outside the browser, to leverage Chrome's sync architecture, and to access the device hardware. Come learn how to take your web app to the next level by turning it into a Chrome packaged app. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "1922",
        "rating": 4.826087,
        "title": "Google I/O 2013 - Upgrading to a Chrome Packaged App",
        "id": "e0W2szZ2qhg"
    },
    "E8qvkGTwiV0": {
        "speakers": [
            "Addy Osmani",
            "Paul Irish"
        ],
        "summary": "In this episode, Addy and Paul look at improving the speed of authoring, the load performance and runtime performance of JavaScript apps. * First up, a case study of reducing Wikipedia's load time by 15 seconds (!) with the Chrome DevTools' Timeline. * Next, The trials and tribulations of the null transforms (aka translateZ(0)). * After, understanding the available JavaScript language tooling landscape. What tools can keep you from making poor mistakes and improve your code's maintainability. * Lastly, a preview of the soon-available Snippets feature in DevTools",
        "viewCount": "5794",
        "rating": 4.943662,
        "title": "The Breakpoint Ep. 6: Accelerating Load Time, Run Time, and JS tooling",
        "id": "E8qvkGTwiV0"
    },
    "EPYnGFEcis4": {
        "speakers": [
            "Paul Kinlan",
            "Peter Beverloo"
        ],
        "summary": "The mobile web is accelerating more rapidly than ever! This session will show you the bleeding edge of the mobile web, enabling you to take your mobile sites and apps to the next level. We will dive into features that you never thought you could enable in a mobile browser and give you practical advice for the year ahead. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "2771",
        "rating": 4.9466667,
        "title": "Google I/O 2013 - Mobile HTML: The Future of Your Sites",
        "id": "EPYnGFEcis4"
    },
    "E8C8ouiXHHk": {
        "speakers": [
            "Justin Uberti"
        ],
        "summary": "WebRTC brings webcam access, p2p, and rich audio/video communication capabilities to the browser. In this talk, we'll give an overview of the WebRTC technologies available today, show how to build WebRTC apps, and discuss the potential this technology adds to the Web Platform. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "73225",
        "rating": 4.9183674,
        "title": "Google I/O 2012 - WebRTC: Real-time Audio/Video and P2P in HTML5",
        "id": "E8C8ouiXHHk"
    },
    "e3McMaHvlBY": {
        "speakers": [
            "Brian Kennish"
        ],
        "summary": "Brian Kennish, a developer advocate for Google Chrome presents how to build an extension for Google Chrome. To learn more visit code.google.com/chrome/extensions.",
        "viewCount": "90445",
        "rating": 4.8068967,
        "title": "Google Chrome Extensions: How to build an extension",
        "id": "e3McMaHvlBY"
    },
    "Ervh-vrTBOw": {
        "speakers": [
            "Ido Green"
        ],
        "summary": "A quick 10min on new important features that we have in Chrome DevTools. You can read a summary of this talk: http://greenido.wordpress.com/2012/10/25/the-new-chromebook-and-new-devtools-tips/",
        "viewCount": "2547",
        "rating": 4.5897436,
        "title": "GDL-IL Chrome DevTools tips",
        "id": "Ervh-vrTBOw"
    },
    "eQxUaUQdWYQ": {
        "speakers": [
            "Joao Wilbert",
            "Oskar Eriksson",
            "Xavier Barrade"
        ],
        "summary": "Built by the Creative Labs team in London, Jam with Chrome was a hugely successful Chrome experiment that allowed users to form a band from nearly anywhere in the world and ''Jam'' like stars in near real-time. We will show you how we built Jam with Chrome using the latest web technologies and give you practical advice and guidance on how you can do the same. We will focus on the Real time WebSockets component, the session management system, and the music engine made using the Web Audio API--come learn how to ''Jam.''. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "2511",
        "rating": 5,
        "title": "Google I/O 2013 - JAM with Chrome: How We Built a Massive Multiplayer Music App Using Web Technology",
        "id": "eQxUaUQdWYQ"
    },
    "EvACKPBo_R8": {
        "speakers": [
            "Ray Cromwell"
        ],
        "summary": "Curious to learn how to port your GWT code to Dart? In this session, we will go over Dart equivalents for various GWT libraries and idioms, techniques for interoperating with existing GWT server backends, and tricks to allow Dart code to talk to existing GWT and Javascript code. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "9071",
        "rating": 4.4166665,
        "title": "Google I/O 2012 - Migrating Code from GWT to Dart",
        "id": "EvACKPBo_R8"
    },
    "euCNWhs7ivQ": {
        "speakers": [
            "Emily Fortuna",
            "Sigmund Cherem"
        ],
        "summary": "Develop large apps in a structured language and still experience fast Edit/Reload development cycles? Indeed, the prophecy has come true. Get crazy productive with Dart's tools, smooth HTML libraries, cross-browser polyfills, and web components based framework. Come learn how you can easily and quickly develop web apps that work cross-browser on both desktop and mobile platforms. We'll show you how to build modern web apps with Web Components and dynamic data-driven views without having to wait for cumbersome compile cycles. Make a change, hit reload, and boom, it's ready for all modern browsers. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "2940",
        "rating": 4.884058,
        "title": "Dart: HTML of the Future, Today! - Google I/O 2013",
        "id": "euCNWhs7ivQ"
    },
    "EWKcFuluXpo": {
        "summary": "Hack-a-thon Results",
        "viewCount": "1415",
        "rating": 4.8333335,
        "title": "Chrome Apps Office Hours: Hack-a-thon Results",
        "id": "EWKcFuluXpo"
    },
    "f5lYNV7eDd8": {
        "speakers": [
            "Chris DiBona"
        ],
        "summary": "-- Contents -- 0:00 - Introduction 0:20 - Chris in the Chrome Comic 0:44 - Release of Chrome source code 1:20 - Throwing code over the wall.. 2:18 - Developing Chrome in the open 5:02 - What won't be released as OSS 5:55 - Not all OSS helps the web -- End --  'Code Conversations' is a new series of videos intended to film casual conversations with notable Google developers and legends in the technology fields. No agenda, no topic.. just thoughts. This video is the first episode of this series, in which Chris DiBona, our intrepid open source programs manager talks to Stephanie Liu of the Developer Team about his 'sweet goatee' in the Chrome Comic. He also explains why Google open sourced Chrome and Android and why we didn't do it sooner. He also touches on why much of Google's software isn't open sourced.  Intros:  Chris DiBona is the open source programs manager at Google, where his team oversees license compliance and supports the open source developer community through the release of open source software projects and programs such as the Google Summer of Code. Before joining Google, Chris was an editor at Slashdot, has edited the books Open Sources: Voices from the Open Source Revolution and Open Sources 2.0: The Continuing Evolution and formerly co-hosted the FLOSS weekly with Leo Laporte. His personal blog is called Ego Food.  Stephanie Liu is a Programs Manager on the Developer Team here at Google.  We'll be checking your comments on this post for feedback and ideas for future Code Conversations.",
        "viewCount": "8297",
        "rating": 4.25,
        "title": "Code Conversations - Chris DiBona on Google's Open Source Programs",
        "id": "f5lYNV7eDd8"
    },
    "f2tJRXDTMuY": {
        "speakers": [
            "Erik Kay"
        ],
        "summary": "Happy birthday Chrome Packaged Apps! Come help us celebrate by learning what's new in the Packaged Apps platform and what's ahead on the roadmap. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "452",
        "rating": 5,
        "title": "Google I/O 2013 - The Chrome Packaged Apps State of the Nation",
        "id": "f2tJRXDTMuY"
    },
    "F_sbusEUz5w": {
        "speakers": [
            "Ray Cromwell",
            "Philip Rogers"
        ],
        "summary": "GWT does more than make awesome Enterprise Apps, it's a great tool for games too. Learn to write 2D and 3D games using HTML5 and GWT, leverage and port existing game libraries and physics engines, share game code between GWT and Android, publish to the Chrome Web Store, and of course, see demos of really neat GWT games in action.",
        "viewCount": "76678",
        "rating": 4.968317,
        "title": "Google I/O 2011: Kick-Ass Game Programming with Google Web Toolkit",
        "id": "F_sbusEUz5w"
    },
    "FCyExI6Blfo": {
        "speakers": [
            "Ilya Grigorik"
        ],
        "summary": "An overview of Google's PageSpeed Service, an online service to automatically speed up loading of your web pages. PageSpeed Service fetches content from your servers, rewrites your pages by applying web performance best practices and serves them to end users via Google's servers across the globe.",
        "viewCount": "9261",
        "rating": 4.984436,
        "title": "Overview of Google PageSpeed Service",
        "id": "FCyExI6Blfo"
    },
    "fav3OOM0acY": {
        "speakers": [
            "Diane Greene"
        ],
        "summary": "Lightning talk by Diane Greene, Founder VMWare and CEO 1998-2008, Entrepreneur, Investor, and Member of the Board of Directors of Google, at 7 Techmakers and a Microphone at Google I/O presented Women Techmakers.",
        "viewCount": "191",
        "rating": 5,
        "title": "Google I/O 2013 - Diane Greene - 7 Techmakers and a Microphone",
        "id": "fav3OOM0acY"
    },
    "fc25ihfXhbg": {
        "speakers": [
            "David Symonds"
        ],
        "summary": "The Go runtime for App Engine is a high performance engine for running web applications. It produces fast responses, starts instances in a fraction of a second, makes the most use of instance hours, and allows your app to do serious processing at full machine speed. Come along to hear how to fully exploit the power of Go on App Engine and make your web applications the best they can be. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "450",
        "rating": 5,
        "title": "Google I/O 2013 - High Performance Apps with Go on App Engine",
        "id": "fc25ihfXhbg"
    },
    "FdsummsTeLo": {
        "speakers": [
            "Paul Irish",
            "Addy Osmani"
        ],
        "summary": "It's a brand new year and Paul Irish and Addy Osmani are back with a grab bag of DevTools tips and tricks. Learn how the DevTools overrides can help you debug your mobile apps, see the experimental support for CSS Regions, identify what initiated all your network requests, and inspect your websocket data. We'll also cover the native memory instrumentation and use the debugger to inspect internal properties of bound JavaScript functions.",
        "viewCount": "9868",
        "rating": 5,
        "title": "Breakpoint Episode 5: DevTools Grab bag",
        "id": "FdsummsTeLo"
    },
    "Fja-TCLWpUc": {
        "speakers": [
            "Arne Roomann-Kurrik"
        ],
        "summary": "In this video, developer advocate Arne Roomann-Kurrik presents additional information on why Google started to work on the concept of web apps for Chrome.",
        "viewCount": "55698",
        "rating": 4.675676,
        "title": "Getting started with apps for the Chrome Web Store",
        "id": "Fja-TCLWpUc"
    },
    "FmsLJHikRf8": {
        "speakers": [
            "Ilya Grigorik",
            "Peter Lubbers"
        ],
        "summary": "Show notes and links: http://bit.ly/har-show. Need a flexible format to record, export, and analyze network performance data? Well, that's exactly what the HTTP Archive format (HAR) is designed to do! Even better, did you know that Chrome DevTools supports it? In this episode we'll take a deep dive into the format (as you'll see, its very simple), and explore the many different ways it can help you capture and analyze your sites performance. Join +Ilya Grigorik and +Peter Lubbers to find out how to capture HAR network traces in Chrome, visualize the data via an online tool, share the reports with your clients and coworkers, automate the logging and capture of HAR data for your build scripts, and even adapt it to server-side analysis use cases! Yes, a rapid fire session of awesome demos - see you there.",
        "viewCount": "5390",
        "rating": 4.7894735,
        "title": "Make The Web Fast - The HAR Show: Capturing and Analyzing performance data with HTTP Archive format",
        "id": "FmsLJHikRf8"
    },
    "fQqiHyiQIJE": {
        "speakers": [
            "Enoch Lau",
            "Jack Kwok",
            "Jez Fletcher"
        ],
        "summary": "The Google Maps API is now on multiple platforms, JavaScript, Android, and iOS. Each platform has it's own special strengths and limitations, and requires special attention. But what if you're building for all three platforms? How do you approach that problem? This session will look at the specialized development for the individual platforms versus generalized development for all three, and the trade offs inherent in each different approach. We will look at when to use our web services, and how to build a strong back-end infrastructure. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "390",
        "rating": 5,
        "title": "Google I/O 2013 - How to Build Multi-Platform Maps with Google's APIs",
        "id": "fQqiHyiQIJE"
    },
    "fqULJBBEVQE": {
        "speakers": [
            "Eric Bidelman"
        ],
        "summary": "Web Components are here to fundamentally change the way we think, build, and consume our web apps. This session will prepare you for the future of the web platform by discussing the lower level technologies that form the basis of Web Components (Shadow DOM, custom elements, MDV, new CSS primitives). Many of these tools have already landed in a modern browser near you!. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "5195",
        "rating": 5,
        "title": "Google I/O 2013 - Web Components: A Tectonic Shift for Web Development",
        "id": "fqULJBBEVQE"
    },
    "FrufJFBSoQY": {
        "speakers": [
            "Mads Ager"
        ],
        "summary": "Google I/O 2009 - V8: Building a High Performance JavaScript Engine. V8 is Google's high-performance JavaScript engine used in Google Chrome. V8 is optimized for well-designed object-oriented applications that make heavy use of objects, function calls, and property access. This talk will provide an overview of the internals of V8 and dive into the advanced virtual-machine technology used. Specifically, details of the use of hidden classes, inline caching, precise generational garbage collection, and snapshotting will be presented. The final part of the talk will discuss initiatives that will propel V8 to the next performance level.  For presentation slides and all I/O sessions, please go to: code.google.com/events/io/sessions.html",
        "viewCount": "16715",
        "rating": 4.9310346,
        "title": "Google I/O 2009 - V8: .High Performance JavaScript Engine",
        "id": "FrufJFBSoQY"
    },
    "fsOiXJxcYAY": {
        "speakers": [
            "John Cormie",
            "Sunil James"
        ],
        "summary": "Come learn about an exciting new networking feature for Google Compute Engine that enables you to specifically control how traffic is routed throughout your virtual network. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "314",
        "rating": 5,
        "title": "Google I/O 2013 - Speed, Efficiency, and Control- Advanced Packet Routing Techniques",
        "id": "fsOiXJxcYAY"
    },
    "FvYxf8b3_BQ": {
        "speakers": [
            "Pete LePage",
            "Gillian Ferrabee",
            "Nicole McDonald"
        ],
        "summary": "All the Web's a Stage: Building a 3D Space in the Browser. Thursday, October 11 - 10:30AM PDT Meet the designers and creative team behind a new sensory Chrome experiment, Movi.Kanti.Revo, in a live, design-focused Q&A. Learn how Cirque du Soleil and Subatomic Systems worked to translate the wonder of Cirque into an environment built entirely with markup and CSS. Host: Pete LePage, Developer Advocate Guests: Gillian Ferrabee, Cirque du Soleil | Nicole McDonald, Director/Creative Director, Subatomic Systems",
        "viewCount": "2952",
        "rating": 3.6,
        "title": "GDL Presents: All the Web's a Stage",
        "id": "FvYxf8b3_BQ"
    },
    "fX0j4c_NAFY": {
        "speakers": [
            "Ilya Grigorik",
            "John Cleveley",
            "Andy Davies",
            "Jackson Gabbard",
            "Steve Thair"
        ],
        "summary": "It's easy to poke fun at websites with multi-megabyte pages, but latency and number of round trips are the biggest killers of page load performance, especially over 3G. How can we get the best out of the network and not let it slow down our apps? What's the best way to handle foreign resources, dependency management, batching and minification?. Panelists: Ilya Grigorik, John Cleveley, Andy Davies, Jackson Gabbard. Moderator: Steve Thair",
        "viewCount": "2484",
        "rating": 5,
        "title": "Edge Conference - Panel 2: Network",
        "id": "fX0j4c_NAFY"
    },
    "FY5iiuQRyEE": {
        "speakers": [
            "Paul Irish",
            "David Blooman",
            "Remy Sharp",
            "Simon Stewart",
            "Ivan Žužak"
        ],
        "summary": "Sites have become too complex to build by hand, and too complex to test without automation. What are the tools we now rely on for authoring and testing? Where are the gaps? Where do we need to focus attention to improve support?. Panelists: Paul Irish, David Blooman, Remy Sharp, Simon Stewart. Moderator: Ivan Žužak",
        "viewCount": "8969",
        "rating": 5,
        "title": "Edge Conference - Panel 7: Testing and tooling",
        "id": "FY5iiuQRyEE"
    },
    "g3aBfkFbPWk": {
        "summary": "Video Footage from a Native Client event on December 8th 2011. In this event, the Native Client team presented the latest news on the technology as well as applications built using Native Client by Square Enix, Supergiant Games, Heartwood Studios and Unity Technologies. To learn more about Native Client visit gonacl.com",
        "viewCount": "13776",
        "rating": 4.93985,
        "title": "Native Client Event: December 8, 2011",
        "id": "g3aBfkFbPWk"
    },
    "g03bcb70kFQ": {
        "speakers": [
            "Nick Baum",
            "Aaron Boodman"
        ],
        "summary": "Google I/O 2009 - Developing Extensions for Google Chrome. Learn how Google Chrome makes it easy to write extensions using the web technologies you already know. This talk will describe the extension system in depth, covering the anatomy of an extension, the process model, and more.  For presentation slides and all I/O sessions, please go to: code.google.com/events/io/sessions.html",
        "viewCount": "12535",
        "rating": 4.707317,
        "title": "Google I/O 2009 - Developing Extensions for Google Chrome",
        "id": "g03bcb70kFQ"
    },
    "g8fJWB2-pYk": {
        "summary": "Rich Notifications",
        "viewCount": "1230",
        "rating": 5,
        "title": "Chrome Apps Office Hours: Rich Notifications",
        "id": "g8fJWB2-pYk"
    },
    "GBxv8SaX0gg": {
        "speakers": [
            "Jorge Lucangeli Obes"
        ],
        "summary": "Today, a carefully developed web app can boast a high level of security, by taking advantage of several technologies: HTML5, CSP, NaCl, and the Chrome extension framework. The objective of this session is to show how these technologies allow a developer to create a web app that rivals or exceeds a desktop app in features, while remaining more secure than its desktop counterpart. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "3882",
        "rating": 4.6842103,
        "title": "Google I/O 2012 - Writing Secure Web Apps and Chrome Extensions",
        "id": "GBxv8SaX0gg"
    },
    "gGglWrxKYrU": {
        "speakers": [
            "Ryan Boyd"
        ],
        "summary": "Ryan Boyd introduces the Google Cloud Platform at the 2013 Game Developers Conference. Provides a high level overview of Google App Engine, Compute Engine, Cloud Storage and BigQuery. These technologies allow you to launch an app without system administrators, while having the ultimate flexibility of root on a virtual machine. Get high performance asset hosting, and analyze terabyte-sized data to optimize games. Momchil Kyurkchiev and Andrew First from Leanplum then talk about how they made a platform to help mobile app developers do A/B testing to optimize their apps. They step through various components of Leanplum and talk about their underlying design decisions.",
        "viewCount": "77",
        "rating": 5,
        "title": "GDC 2013 - Introduction to the Google Cloud Platform",
        "id": "gGglWrxKYrU"
    },
    "gGVkVQN63Yc": {
        "speakers": [
            "Erik Kay",
            "Aaron Boodman"
        ],
        "summary": "Video Footage from the Google Chrome Extensions launch event on 12/09/09. Erik Kay and Aaron Boodman, technical leads for the Google Chrome Extensions team demonstrate how to build, debug and share a Google Chrome extension.",
        "viewCount": "4948",
        "rating": 5,
        "title": "Google Chrome Extensions: Launch Event (part 3)",
        "id": "gGVkVQN63Yc"
    },
    "Gn_jlvkHTnM": {
        "speakers": [
            "Nick Baum"
        ],
        "summary": "Nick Baum, product manager for Google Chrome's extensions system, demonstrates uploading and publishing an extension to the Google Chrome Extensions gallery. Visit code.google.com/chrome/extensions for more information.",
        "viewCount": "7580",
        "rating": 4.757576,
        "title": "Google Chrome Extensions: Publishing",
        "id": "Gn_jlvkHTnM"
    },
    "gkb_x9ZN0Vo": {
        "speakers": [
            "Paul Kinlan",
            "Renato Mangini"
        ],
        "summary": "Ever wondered if you could use NodeJS libraries in your JavaScript code running in a browser? Join Paul Kinlan and Renato Mangini as they explore the possibilities of running NodeJS code in a Chrome packaged app.",
        "viewCount": "4058",
        "rating": 5,
        "title": "Chrome Apps Office Hours: NodeJS in Chrome packaged apps",
        "id": "gkb_x9ZN0Vo"
    },
    "GPjlubm32DM": {
        "speakers": [
            "Darin Fisher",
            "Erik Kay",
            "Felix Lin",
            "Greg Simon",
            "Ian Ellison-Taylor",
            "Jeff Chang",
            "Kan Liu",
            "Lars Bak",
            "Matthew McNulty",
            "Vangelis Kokkevis"
        ],
        "summary": "Meet the senior staff from the Web Platform team, the Front End/UI team, the Chrome Apps team, and the Chrome OS team. At this talk, you'll hear senior Chrome developers talk about future plans for Chrome and the web platform. You'll have the opportunity to ask them as many difficult questions as can fit in the time available!. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "478",
        "rating": 5,
        "title": "Google I/O 2013 - Fireside Chat with the Chrome Team",
        "id": "GPjlubm32DM"
    },
    "gqc88qWuiI4": {
        "speakers": [
            "Chelsea Derrick"
        ],
        "summary": "It's tempting to view CSS optimization as a dark art, for initiates only. This session will focus on identifying and resolving slow renders, with an emphasis on layout and paint times. We'll use Chrome DevTools to find, benchmark, and debug slowness in the render-side of an application. Uncovering a number of sluggish culprits, we'll explore where the time is spent and dig into profiling data from Chrome's internals. You'll walk away with a better understanding of how to use your time wisely while making your application scream with speed, and smart workarounds that address common CSS performance problems. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "942",
        "rating": 4.866667,
        "title": "Google I/O 2013 - True Grit: Debugging CSS & Render Performance",
        "id": "gqc88qWuiI4"
    },
    "h-ge4RRl9Vk": {
        "speakers": [
            "Paul Kinlan"
        ],
        "summary": "A very quick video of an app we built to control an AR Drone using the new Chrome Apps platform. Made with 100% Javascript. The code for the drone is not yet available, but we will work something out soon.",
        "viewCount": "3382",
        "rating": 4.9130435,
        "title": "Chrome Apps: a quick network demo",
        "id": "h-ge4RRl9Vk"
    },
    "h2djIdAFc5U": {
        "speakers": [
            "Jake Archibald"
        ],
        "summary": "DevTools helps you get great experiences out of the desktop, but how do you do it for mobile, where the performance characteristics are normally an order of magnitude slower than desktop. In this show Jake Archibald will deep dive into Performance via the devtools to show you how to get the best out of your mobile web pages. Table of Contents:. + Setting up DevTools connection to mobile: http://www.youtube.com/watch?feature=player_detailpage&v=h2djIdAFc5U#t=1201s. + Testing Fixed position: http://www.youtube.com/watch?feature=player_detailpage&v=h2djIdAFc5U#t=2023s. Links:. + Demos: http://jsbin.com/emegov/1/quiet",
        "viewCount": "2295",
        "rating": 4.84,
        "title": "Mobile Web Thursdays: Performance on Mobile",
        "id": "h2djIdAFc5U"
    },
    "hAzhayTnhEI": {
        "speakers": [
            "Nat Duca",
            "Tom Wiltzius"
        ],
        "summary": "Building high-performance web apps is hard! When animations hitch, mouse hover effects lag, or page scrolls stutter, we call it jank. This talk is about hunting jank down and exterminating it. Sources of jank in web apps include garbage collector runs, long image decodes, heavy paint times for DOM elements, JavaScript-heavy input handlers, unexpected WebKit layer invalidations, and more -- all getting in the way of the 60FPS every modern app developer should aim for. In this talk we'll go through a few techniques to ensure your web app has smooth animations, transitions, and scrolling. We'll cover ways to use Chrome's Developer Tools to root out jank, as well as more advanced Chrome graphics profiling tools the intrepid can use to dig into what's going on behind the scenes. We'll even peek gingerly under the covers of WebKit to explain why that pesky hitch occurs in the first place. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "15891",
        "rating": 4.9281435,
        "title": "Google I/O 2012 - Jank Busters: Building Performant Web Apps",
        "id": "hAzhayTnhEI"
    },
    "HCR7i5F5L8c": {
        "speakers": [
            "Brad Green",
            "Miško Hevery"
        ],
        "summary": "We'll cover the design decisions that drove creating AngularJS, the JavaScript framework that combines data binding, reusable components, dependency injection, and a host of other powerful capabilities for building modern web applications. Come join us and learn how to build extremely scalable applications that are fast to build, trivial to change and maintain, easy to test, and that clearly express your intent to all developers on your team. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "9539",
        "rating": 4.964758,
        "title": "Google I/O 2013 - Design Decisions in AngularJS",
        "id": "HCR7i5F5L8c"
    },
    "hFsCG7v9Y4c": {
        "speakers": [
            "Chris Wilson"
        ],
        "summary": "This session will cover the web audio capabilities for games and music. We'll walk through the audio element and the Web Audio API, and dive deep into using the Web Audio API for game audio and building music applications. We'll also cover how to use the Node graph structure to build audio processing chains, and how to use analysis to do interesting tricks. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "6893",
        "rating": 4.904762,
        "title": "Google I/O 2012 - Turning the Web Up to 11",
        "id": "hFsCG7v9Y4c"
    },
    "hGc4XBc9P9c": {
        "speakers": [
            "Aaron Boodman",
            "Erik Kay"
        ],
        "summary": "Video Footage from the Google Chrome Extensions launch event on 12/09/09. Aaron Boodman and Erik Kay technical leads for the Google Chrome extensions team present a quick history of the extensions system of Google Chrome and discuss its design principles, focusing on why extensions are webby.",
        "viewCount": "4310",
        "rating": 4.7647057,
        "title": "Google Chrome Extensions: Launch Event (part 2)",
        "id": "hGc4XBc9P9c"
    },
    "HK2rSAe_HLA": {
        "speakers": [
            "Colt McAnlis"
        ],
        "summary": "In this video, Colt McAnlis, developer advocate for Native Client, describes how you can start using Native Client for your apps. To learn more about Native Client visit www.gonacl.com",
        "viewCount": "7183",
        "rating": 5,
        "title": "Native Client: How to get started",
        "id": "HK2rSAe_HLA"
    },
    "HijZNR6kc9A": {
        "speakers": [
            "Paul Irish",
            "Addy Osmani"
        ],
        "summary": "Take Coffeescript to Javascript to Minified and all the way back with source maps. In addition to a new Coffeescript sourcemap workflow, we'll cover the latest sourcemap updates so you can understand how to dramatically improve your debugging experience. Finally, Paul and Addy will be joined by special guest—Yeoman core contributor Sindre Sorhus—to discuss what big new changes are coming to the project.",
        "viewCount": "6592",
        "rating": 4.908046,
        "title": "The Breakpoint Ep 3: The Sourcemap Spectacular with Paul Irish and Addy Osmani",
        "id": "HijZNR6kc9A"
    },
    "HKvy90k0BuU": {
        "speakers": [
            "James Hawkins",
            "Joe Marini"
        ],
        "summary": "The fast pace of innovation on the Chrome platform calls to mind the Wild West, but developing a product on this frontier is easier than it seems. In this session, the lead engineer of the Google+ Photos Chrome application will provide an anecdotal account of what it takes to ship a real-world Chrome app. Take advantage of lessons learned, including how to get the changes you need into the platform. In addition, we will highlight several new APIs in Chrome packaged apps that allow your application to interact with and drive real-world devices. Learn how we built Google+ Photos to look and act like a native application and learn how to do the same with your Chrome app. For all I/O 2013 sessions, go to https://developers.google.com/live'",
        "viewCount": "204",
        "rating": 5,
        "title": "Google I/O 2013 - Building Google+ Photos: Chrome Apps in Focus",
        "id": "HKvy90k0BuU"
    },
    "huawCRlo9H4": {
        "speakers": [
            "Kasper Lund",
            "Lars Bak"
        ],
        "summary": "A fundamental necessity for innovation within web apps is fast execution speed. This talk will take a deep dive into the machine rooms of both V8 and the Dart VM and explain some of the reasons why a new execution engine is needed for taking the web platform to the next level. Please join us to hear about how programming languages impact the underlying virtual machines, complexity, on-the-fly code generation, and predictable performance. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "2199",
        "rating": 5,
        "title": "Web Languages and VMs: Fast Code is Always in Fashion. (V8, Dart) - Google I/O 2013",
        "id": "huawCRlo9H4"
    },
    "huXucPChX3g": {
        "speakers": [
            "Colt McAnlis"
        ],
        "summary": "(Pre-recorded GDC content). There's a new wave of console/pc/mobile game developers moving to the web looking to take advantage of the massive user base, along side of the powerful social graphs available there. The web as a platform is a very different technology stack than consoles / mobile, and as such, requires different development processes. This talk is targeted towards game developers who are looking to understand more about the development processes for web development including where to host your assets, proper techniques in caching to the persistent file store; dealing with sessions, storing user state, user login, game state storage, social graph integration, localization, audio, rendering, hardware detection and testing / distribution. If you're interested in developing a web game, you need to attend this talk!. Speaker: Colt McAnlis",
        "viewCount": "15466",
        "rating": 4.9461884,
        "title": "GDC 2012: Best practices in developing a web game",
        "id": "huXucPChX3g"
    },
    "ie4I7B-umbA": {
        "speakers": [
            "Boris Smus"
        ],
        "summary": "One of the great features of the modern web is that sites work on any device with a browser. This session will focus on creating UIs for the cross-device web. We will cover building web sites that support multiple device form factors (responsive and non-responsive approaches), discuss single page sites and some of the layout features in modern mobile browsers, and do a deep dive into multi-touch input on the web. Finally, we'll show some of the awesome new mobile debugging tools in Chrome and Chrome for Android. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "4632",
        "rating": 4.7192984,
        "title": "Google I/O 2012 - Fast UIs for the Cross-Device Web",
        "id": "ie4I7B-umbA"
    },
    "iDiulvWRcZs": {
        "speakers": [
            "Addy Osmani",
            "Seth Ladd"
        ],
        "summary": "Addy Osmani interviews Seth Ladd to learn more about Dart. Join this episode to discover how Dart relates to JavaScript, who the intended audience for Dart is, and what Dart's motivations are. If you're curious what Dart is all about, and if it wants to replace JavaScript, this is the episode for you!. Learn more at http://dartlang.org or read about this video: http://blog.sethladd.com/2012/10/9-dart-myths-debunked.html",
        "viewCount": "4969",
        "rating": 4.768116,
        "title": "Debunking Dart Myths For Web Developers",
        "id": "iDiulvWRcZs"
    },
    "iH4D2LiKbXg": {
        "speakers": [
            "Paul Kinlan"
        ],
        "summary": "Join Paul Kinlan for the second Web Intents Wednesday where he will discuss the latest and greatest Web Intents news, RSS integration, answer your questions, and show you some cool demos.",
        "viewCount": "1505",
        "rating": 5,
        "title": "Web Intents Wednesday",
        "id": "iH4D2LiKbXg"
    },
    "ihzZrS69i_s": {
        "speakers": [
            "Chet Haase",
            "Romain Guy"
        ],
        "summary": "This talk will show various types of application animations and the code for how to achieve them. Developers should leave the presentation (not too quickly!) with more knowledge about how Android animations work, how to use the APIs effectively, and how to pull together various techniques to create more involved, more interesting and more compelling animations for their applications. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "4291",
        "rating": 5,
        "title": "Google I/O 2013 - A Moving Experience",
        "id": "ihzZrS69i_s"
    },
    "IiN9fxwjcL0": {
        "summary": "-- Contents -- 0:00 - Introduction 2:12 - WebKit Glue layer 5:03 - The Render process 5:38 - Renderer Host 6:40 - Tab Contents layer 7:00 - Browser Window 8:00 - Check Deps (dependencies) 9:14 - Q & A -- End --  Chromium's multi-process architecture and tight integration with WebKit necessitate a heavily layered approach. In this talk, Brett Wilson introduces each of the layers and explains how they fit together. This video is a great complement to this page: http://dev.chromium.org/developers/design-documents/displaying-a-web-page-in-chrome",
        "viewCount": "5196",
        "rating": 4.6190476,
        "title": "The Organization and Abstraction Layers of Chromium's Code",
        "id": "IiN9fxwjcL0"
    },
    "IP0nMv_NI1s": {
        "speakers": [
            "Finnur Thorarinsson"
        ],
        "summary": "Finnur Thorarinsson, a software engineer at Google, presents how a developer can debug a Google Chrome extension using Google Chrome's developer tools (chromium.org/devtools). For more information on extensions, go to code.google.com/chrome/extensions",
        "viewCount": "29292",
        "rating": 4.9591837,
        "title": "Google Chrome Extensions: Developing and Debugging",
        "id": "IP0nMv_NI1s"
    },
    "ith5K5mWr_g": {
        "speakers": [
            "Eric Bidelman"
        ],
        "summary": "Video footage from keynote presentation at Google Developer Day 2010 in Sao Paulo, Brazil.  Mario Queiroz, VP Product Management, Google (pt-BR) Eric Bidelman, Developer Advocate, Google (en) Eric Tholomé, Product Management Director, Google (en) Marcelo Marzola, CEO, Predicta/BTBuckets (pt-BR) Marcelo Quintella, Product Manager, Google (pt-BR)  For more information on Google Developer Day in Sao Paulo, see http://www.google.com/events/developerday/2010/sao-paulo/  Follow us on the Code blog and on Twitter: http://googlecode.blogspot.com  http://twitter.com/googlecode http://twitter.com/googledevbr (in pt-BR)  Hashtag #gddbr",
        "viewCount": "37164",
        "rating": 4.4545455,
        "title": "Google Developer Day 2010 in Sao Paulo - Keynote (pt-BR & en)",
        "id": "ith5K5mWr_g"
    },
    "iUQ1fvdO9GY": {
        "speakers": [
            "Addy Osmani"
        ],
        "summary": "Writing a modern web app these days can sometimes feel like a tedious process; frameworks, boilerplates, abstractions, dependency management, build processes.the list of requirements for a front-end workflow appear to grow each year. What if however, you could automate a lot of this? This session introduces you to the Yeoman workflow, a combination of three tools working in harmony to keep you productive on the front-end. Whether you're using JavaScript or CoffeeScript, RequireJS or script tags, this workflow can help you spend less time on process and more time on what matters - building great web apps. We will walk-through how to use Yo - a scaffolding tool for creating apps, Bower - a package manager for client-side dependency management and Grunt - a popular task-based build tool.",
        "viewCount": "9743",
        "rating": 5,
        "title": "Automating Your Front-End Workflow With Yeoman 1.0",
        "id": "iUQ1fvdO9GY"
    },
    "Iz-AbBE7AlM": {
        "speakers": [
            "Sam Dutton"
        ],
        "summary": "Google's Developer Advocate Sam Dutton after his presentation at Devoxx 2012 in Antwerp. Discusses WebRTC's goals and how this peer-to-peer technology is likely to enable developers to build awesome﻿ new web applications.",
        "viewCount": "1328",
        "rating": 4.8,
        "title": "Devoxx 2012: WebRTC",
        "id": "Iz-AbBE7AlM"
    },
    "J7Q0a_Fz1Kg": {
        "speakers": [
            "Brad Chen"
        ],
        "summary": "In this video, Brad Chen, tech lead for Native Client, describes some of the core concepts behind the technology. To learn more about Native Client visit www.gonacl.com",
        "viewCount": "10395",
        "rating": 4.881188,
        "title": "Native Client: A look behind the scenes",
        "id": "J7Q0a_Fz1Kg"
    },
    "j8oFAr1YR-0": {
        "speakers": [
            "Erik Kay",
            "Mihai Parparita"
        ],
        "summary": "For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "25983",
        "rating": 4.8907104,
        "title": "Google I/O 2012 - The Next Evolution of Chrome Apps",
        "id": "j8oFAr1YR-0"
    },
    "JcQdl8x0tws": {
        "speakers": [
            "John Mccutchan",
            "Pete LePage"
        ],
        "summary": "Did you know that you can use Native Client inside a Chrome App? Join +John Mccutchan and +Pete LePage as they introduce Native Client Acceleration Modules (NaCl AM) which expose C++ libraries to JavaScript programs. NaCl AMs can, be used for bulk data processing (compression, encryption) but they also work well in interactive applications that require low latency. We'll explain how to build a NaCl Acceleration Module and demo a Bullet Physics engine running inside a Chrome App with a NaCl AM interacting with an HTML and JavaScript UI using three.js. We'll be live on Tuesday December 11th at at 9am PT, showing you code, samples and answering your questions.",
        "viewCount": "2172",
        "rating": 5,
        "title": "Chrome Apps + Native Client",
        "id": "JcQdl8x0tws"
    },
    "jD_-r6y558o": {
        "speakers": [
            "Ryan Fioravanti"
        ],
        "summary": "Learn what it takes to build an HTML5 mobile app that will wow your users. This session will focus on speed, offline support, UI layouts, and the tools necessary to set up a productive development environment. Come to this session if you're looking to make a killer mobile web app that stands out amongst the competition. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "3463",
        "rating": 4.909091,
        "title": "Google I/O 2012 - Building High Performance Mobile Web Applications",
        "id": "jD_-r6y558o"
    },
    "JeR506RJQjQ": {
        "summary": "This is part two of the Google Games Chat series. Episode 1 ended abruptly, but if you want a sneak preview, check it out here: http://www.youtube.com/watch?v=XkDKdeu5qT4. Yeah! The Google Games Chat is back! Join the Google games crew as we talk about interesting industry trends, discuss challenges facing today's game developers, answer your hard hitting questions, and figure out why our first video never made it onto YouTube. Ask us questions in the Google Moderator section below, or else this might just be another 45 minutes of awkward silence.",
        "viewCount": "3195",
        "rating": 4.6153846,
        "title": "Google Games Chat, Episode 2",
        "id": "JeR506RJQjQ"
    },
    "Jm5rVSevb7E": {
        "speakers": [
            "Pete LePage",
            "Paul Irish",
            "Addy Osmani",
            "Paul Kinlan",
            "Sam Dutton"
        ],
        "summary": "Coming to you live from London this time. Curious about web app development, HTML5, Chrome, Yeoman, or anything else? This is your chance to ask the Chrome Developer Relations team all of your questions. A lot of the team members are in London this week, so we'll host the meeting live from there. Pete LePage, Paul Irish, Addy Osmani, Paul Kinlan, and Sam Dutton will be on hand to take your questions.",
        "viewCount": "3188",
        "rating": 4.714286,
        "title": "Chrome Office Hours, live from London",
        "id": "Jm5rVSevb7E"
    },
    "jOqnHIpyIr0": {
        "speakers": [
            "Alfred Spector",
            "Jeff Dean",
            "Peter Norvig",
            "Thad Starner"
        ],
        "summary": "Research at Google is unique, as it is conducted across the entire Engineering organization - by Research Scientists as well as Software Engineers. Teams are integrated, boundaries are fluid, and we face challenges together while retaining a close feedback loop from our users. This enables us to quickly build, iterate, and launch new and innovative products that change the state of the art and thereby produce new research results. Google's definition of research is broad and happens in multiple ways across the organization. Our research results in technology advances in the areas of Audio/Video Fingerprinting, Image Understanding, MapReduce/Parallel Computing, Deep Learning, and Parsing at Scale, which we apply to many of our products. And, it also results in new whole new products, such as Voice Search and Google Translate. Learn about Google's hybrid approach to research from the engineers and scientists behind ideas such as Google Glass, MapReduce, Search, and online education, who conduct big idea experiments that translate into real-time innovation at Google. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "565",
        "rating": 4.6666665,
        "title": "Google I/O 2013 - Fireside chat with Research at Google",
        "id": "jOqnHIpyIr0"
    },
    "JuaBy3e6fd4": {
        "speakers": [
            "Amy Unruh",
            "Kim Cameron"
        ],
        "summary": "Highly scalable and rapid data collection and analysis is a key need for many mobile and gaming apps, as well as for sensor networks and the ''Internet of Things.'' We'll show how the Data Sensing Lab incorporates a key Google Cloud Platform pattern: a high-throughput pipeline for data collection, processing, and analysis. We use the Cloud Endpoints API to collect constantly streaming data; process large amounts of data with high throughput using App Engine, Cloud Storage, and data transformation on Compute Engine; and query many GBs of collected data in just a few seconds using BigQuery. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "3263",
        "rating": 4.943662,
        "title": "Google I/O 2013 - Behind the Data Sensing Lab: Gathering, Processing, and Analyzing Data at Scale",
        "id": "JuaBy3e6fd4"
    },
    "jXqrgtm-yF8": {
        "speakers": [
            "Jake Archibald",
            "Addy Osmani"
        ],
        "summary": "Jake Archibald and Addy Osmani take a dive in to Chrome Dev Tools for Mobile and show you how you can get the best out of Chrome for Mobile. Addy also demos MIHTool and shows you how to debug web apps on iOS",
        "viewCount": "3532",
        "rating": 4.870968,
        "title": "Mobile Web Thursday: Dev Tools",
        "id": "jXqrgtm-yF8"
    },
    "JyHXtviaTBQ": {
        "summary": "-Setting up ChromeVox. -Using ChromeVox to listen to your web app. -Common pitfalls for web accessibility and how to fix them. -How we test ChromeVox code using Chrome and. ChromeVox.",
        "viewCount": "1881",
        "rating": 5,
        "title": "ChromeVox for Web Accessibility",
        "id": "JyHXtviaTBQ"
    },
    "K6JshvblIcM": {
        "speakers": [
            "Ronald Bultje"
        ],
        "summary": "According to Cisco, video data will be 55 percent of all consumer Internet traffic by 2016. With that much data traversing networks, efficient video compression will be more important than ever, especially on mobile networks. We are very excited about the new VP9 codec, which delivers better video quality at lower data rates than competing technologies. Furthermore, VP9 was developed entirely in the open as a royalty-free technology. In this session you will learn how VP9 performs against H.264 and other other codecs in quality and decoding speed, how to create WebM videos with VP9 and the new Opus audio codec, and how to deploy VP9 content to Chrome users in HTML5 video. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "6001",
        "rating": 4.911111,
        "title": "Google I/O 2013 - WebM and the New VP9 Open Video Codec",
        "id": "K6JshvblIcM"
    },
    "K7sG1dRSn4c": {
        "speakers": [
            "Paul Kinlan",
            "Paul Lewis"
        ],
        "summary": "Ask and vote for questions: http://goo.gl/t3SFT. Join us next week as we show you how we used a Chrome App to control an AR Parrot Drone! This is just one of the many cool things that you can do with Chrome Apps. Using the networking APIs, we were able to pilot the AR Parrot Drone, and get data back from its on-board sensors. We'll take the app apart, show you how were were able to get everything to work, and maybe even take it for a live spin on air!",
        "viewCount": "2936",
        "rating": 4.857143,
        "title": "Chrome Apps Office Hours: Controlling an AR Parrot Drone",
        "id": "K7sG1dRSn4c"
    },
    "KOsJIhmeXoc": {
        "speakers": [
            "Nick Bray"
        ],
        "summary": "Native Client brings native code to the web - as safely and securely as JavaScript. However, code run by Native Client must follow a few rules to ensure safety and to guarantee that the code integrates smoothly with a web application. This session will follow a line of code throughout its lifecycle: compiled, loaded across the network, and run on a user's machine. Along the way, the nuts and bolts of Native Client's security mechanisms will be explored, as well as the APIs that let native code integrate with the web rather than be tied to a particular operating system. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "2653",
        "rating": 5,
        "title": "Google I/O 2012 - Life of a Native Client Instruction",
        "id": "KOsJIhmeXoc"
    },
    "ktwJ-EDiZoU": {
        "speakers": [
            "Addy Osmani",
            "Paul Lewis"
        ],
        "summary": "In this first episode of the The Breakpoint—a show dedicated to developer tools and time-saving techniques. Addy Osmani and Paul Lewis (sitting in for Paul Irish who was out sick) talk about Yeoman.",
        "viewCount": "26296",
        "rating": 4.913747,
        "title": "The Breakpoint Ep. 1: Chrome DevTools with Addy Osmani and Paul Lewis",
        "id": "ktwJ-EDiZoU"
    },
    "kVSo4buDAEE": {
        "summary": "The DevTools have evolved over the past year to offer a number of features that can enrich your development workflow, helping you achieve more common tasks without the need to leave your browser. This session introduces you to some of these features, including Workspaces - a convenient way to create and edit new applications. We will also look at a better Sass editing workflow, where changes can be made directly to your source files without flipping back and forth with a compiler to generate your CSS.",
        "viewCount": "15051",
        "rating": 4.962963,
        "title": "Improving Your 2013 Productivity With The Chrome DevTools",
        "id": "kVSo4buDAEE"
    },
    "kvZTOCAG_-0": {
        "speakers": [
            "Justin Fagnani",
            "Seth Ladd"
        ],
        "summary": "Come see what's new in Dart with its comprehensive, open-source ecosystem for the modern web developer. Learn how to be more productive with a new language: future-based DOM, package manager, JS-interop, a tree-shaking compiler to JavaScript, SIMD, Web Components, a rich editor, and much more. You'll leave this talk all caught up with Dart and ready to make the web awesome. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "273",
        "rating": 4.6363635,
        "title": "What's New in Dart: Your First-class Upgrade to Web Development - Google I/O 2013",
        "id": "kvZTOCAG_-0"
    },
    "KyIBcnJ6xwY": {
        "speakers": [
            "Chris Carde",
            "Kal Mos",
            "Mike Cheng"
        ],
        "summary": "An iconic auto manufacturer, Mercedes-Benz strives to lead the automotive industry in technology innovation. Learn how Mercedes created amazing experiences with Google Maps and the Places API in ''Digital Drive Style'' -- a connected, social navigation system powering the cockpit user experience from a smartphone. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "154",
        "rating": 5,
        "title": "Google I/O 2013 - Places API-Powered Navigation: A Case Study with Mercedes Benz",
        "id": "KyIBcnJ6xwY"
    },
    "L3ugr9BJqIs": {
        "speakers": [
            "John McCutchan",
            "Loreena Lee"
        ],
        "summary": "Introduction to JavaScript memory management basics and a deeper dive into the Heap Profiler in Chrome DevTools with John McCutchan and Loreena Lee. Time Codes:. JavaScript Memory Management Basics: 1:00. Profiling with Chrome DevTools: 7:37. Three Snapshot technique: 16:00. Tale of the missing object key: 24:10",
        "viewCount": "4424",
        "rating": 4.9238095,
        "title": "The Breakpoint Ep. 8: Memory Profiling with Chrome DevTools",
        "id": "L3ugr9BJqIs"
    },
    "laLudeUmXHM": {
        "speakers": [
            "Aaron Boodman"
        ],
        "summary": "Aaron Boodman, an engineer at Google, presents content scripts, one of the features of Google Chrome's extension system, as well as the concept of isolated worlds (keeping content scripts isolated from each other and from the pages they are running on). To learn more visit code.google.com/chrome/extensions.",
        "viewCount": "31240",
        "rating": 4.794872,
        "title": "Google Chrome Extensions: Content Scripts and Isolated Worlds",
        "id": "laLudeUmXHM"
    },
    "ld7kZRpMGb8": {
        "speakers": [
            "Alan Viverette",
            "Casey Burkhardt",
            "T.V. Raman"
        ],
        "summary": "We'll illustrate affordances on the Android platform that aid blind and low-vision users, and explain what application developers need to pay attention to in order to reach the widest possible user base. The primary focus of this talk is making custom Android views accessible. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "343",
        "rating": 5,
        "title": "Google I/O 2013 - Enabling Blind and Low-Vision Accessibility On Android",
        "id": "ld7kZRpMGb8"
    },
    "lkwkx8NO4CY": {
        "speakers": [
            "Josh Estelle",
            "Rohit Khare"
        ],
        "summary": "Hundreds of millions of users rely on Google Translate â what new markets your apps, sites, or analytics unlock with our Translate API on the Google Cloud Platform? We'll explore the AI that Google uses to analyze billions of documents across 60+ languages. Understanding how statistical machine translation works can help identify appropriate commercial applications, such as user-generated content, news and reviews, and localization. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "258",
        "rating": 5,
        "title": "Google I/O 2013 - Found in Translation: Going Global with the Translate API",
        "id": "lkwkx8NO4CY"
    },
    "lMrkCoqgoxw": {
        "speakers": [
            "Dominic Mazzoni",
            "Rachel Shearer"
        ],
        "summary": "Providing a basic HTML site used to be the best way to make sure your content was accessible to all users. But times have changed, and now you can use HTML5 techniques to provide an experience that's just as rich and interactive for people who use assistive technology. The emphasis of this talk will be on techniques that work today in the latest browser versions. Techniques covered will include proper use of ARIA along with focus management and keyboard navigation.",
        "viewCount": "9611",
        "rating": 5,
        "title": "Google I/O 2011: Creating Accessible Interactive Web Apps using HTML5",
        "id": "lMrkCoqgoxw"
    },
    "LQms5F3ZlcU": {
        "speakers": [
            "Paul Kinlan"
        ],
        "summary": "Join host Paul Kinlan and the creators of Chrome Web Lab in the studio, as they dive into the technology and design behind Sketchbots. Discover the magic and learn about the science behind this experiment: http://www.chromeweblab.com/en-GB/sketchbots#tech.",
        "viewCount": "1040",
        "rating": 4.3846154,
        "title": "GDL Presents Push the Limits: Chrome Web Lab, Sketchbots",
        "id": "LQms5F3ZlcU"
    },
    "LRkLQw5rLy8": {
        "speakers": [
            "Andrew Hanushevsy",
            "Garrick Evans",
            "Sergey Panitkin"
        ],
        "summary": "In this talk we will describe the ATLAS Experiment on Google Compute Engine (GCE) scientific computing project and illustrate several examples of large-scale high performance computing installations on GCE, including a 1000-core PROOF cluster for ATLAS data analysis and a 4000-core HTCondor cluster used for simulation of LHC collision events. We will also discuss Xroot technology used for high-performance data clustering. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "281",
        "rating": 5,
        "title": "Google I/O 2013 - Cloud Computing and High-Energy Particle Physics: ATLAS Experiment at CERN & GCE",
        "id": "LRkLQw5rLy8"
    },
    "LwE_3aRapvc": {
        "speakers": [
            "Johnie Lee",
            "Pallavi Naresh",
            "David Butcher"
        ],
        "summary": "In this session, we will introduce you to the Wallet Objects Loyalty API. Learn how you can integrate your loyalty programs into Google Wallet and make it available to millions of users to discover. Drive engagement of your loyalty program by enabling users to use Google Wallet to show and use their loyalty card, check their loyalty/reward point balances and much more. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "414",
        "rating": 5,
        "title": "Google I/O 2013 - Redefining Loyalty In The Mobile Age",
        "id": "LwE_3aRapvc"
    },
    "LjDKQaRmkDc": {
        "speakers": [
            "Paul Kinlan",
            "Pete LePage"
        ],
        "summary": "Ask and vote for questions at https://developers.google.com/live/shows/7320022-4002/. Join Paul Kinlan and Pete LePage as they discuss OAuth flow in Chrome packaged app and show a demo of how you can connect to Instagram and fetch a user's photo feed.",
        "viewCount": "1",
        "rating": 5,
        "title": "Chrome Apps Office Hours - the Identity API",
        "id": "LjDKQaRmkDc"
    },
    "lYk6oc9w8PY": {
        "speakers": [
            "Paul Lewis",
            "Paul Kinlan"
        ],
        "summary": "Join Paul Lewis and Paul Kinlan on a deep-dive in to the Chrome Apps windowing AP. In this episode we will show you how to build advanced applications that can manage and manipulate multiple windows.",
        "viewCount": "2932",
        "rating": 4.8431373,
        "title": "Chrome Apps Office Hours: Building awesome multi-window apps",
        "id": "lYk6oc9w8PY"
    },
    "M3uWx-fhjUc": {
        "speakers": [
            "Michael Bolin"
        ],
        "summary": "Most developers who have tinkered with JavaScript could not imagine writing 1,000 lines of code in such a language, let alone 100,000. Yet that is exactly what Google engineers have done using a suite of JavaScript tools named 'Closure' to produce many of the most popular and sophisticated applications on the Web, such as Gmail and Google Maps.",
        "viewCount": "48787",
        "rating": 4.911602,
        "title": "Google I/O 2011: JavaScript Programming in the Large with Closure Tools",
        "id": "M3uWx-fhjUc"
    },
    "M6ro0mib31M": {
        "speakers": [
            "Silvano Luciani",
            "Xiangtian Dai"
        ],
        "summary": "Let us walk you through how to add Google+ Sign-In to your iOS app, connect user's to their friends, drive more engagement using interactive posts, and monitor your app's performance on Google+. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "282",
        "rating": 5,
        "title": "Google I/O 2013 - Google+ Sign-In for iOS Developers",
        "id": "M6ro0mib31M"
    },
    "m_bgmdmsxU4": {
        "speakers": [
            "Aparna Chennapragada"
        ],
        "summary": "Did you know that you can use the same Schema.org markup that you use on the web in Gmail and on Google Search?. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "132",
        "rating": 5,
        "title": "Google I/O 2013 - Structured Data: From Inbox to Searchbox",
        "id": "m_bgmdmsxU4"
    },
    "marDcG1icDg": {
        "speakers": [
            "Adam Eijdenberg",
            "Ben Wiley Sittler"
        ],
        "summary": "This session will provide a clear, step-by-step approach to accessing Google Cloud Platform resources using OAuth 2.0. We will define the most important use cases and show how to build those solutions using practical code examples. The goal is to help you solve your authorization problems correctly and easily, without having to become an OAuth expert. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "379",
        "rating": 5,
        "title": "Google I/O 2013 - Keys to the Kingdom: Design Patterns for Using OAuth in the Cloud",
        "id": "marDcG1icDg"
    },
    "Mk-tFn2Ix6g": {
        "speakers": [
            "Paul Irish"
        ],
        "summary": "Building a solid webapp is a challenge for all developers, but a plethora of tools have emerged recently to assist you. From starting boilerplates, to performance tuning and build tools, you'll get a full overview of the tooling ecosystem. In this session, you'll learn which mature and valuable open source projects can save you time as well as get answers to common questions in building a webapp. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "62000",
        "rating": 4.931232,
        "title": "Google I/O 2012 - Better Web App Development Through Tooling",
        "id": "Mk-tFn2Ix6g"
    },
    "mQpo22NN438": {
        "summary": "Video Footage from the Google Chrome Extensions launch event on 12/09/09. Xmarks, eBay and Google Translate present their experience developing an extension for Google Chrome.",
        "viewCount": "4425",
        "rating": 4.8095236,
        "title": "Google Chrome Extensions: Launch Event (part 5)",
        "id": "mQpo22NN438"
    },
    "MT7cd4M9vzs": {
        "speakers": [
            "Francesc Campoy Flores",
            "Kurt Schwehr",
            "Mano Marks"
        ],
        "summary": "Tens of thousands of ships report their position at least once every 5 minutes, 24 hours a day. Visualizing that quantity of data and serving it out to large numbers of people takes lots of power both in the browser and on the server. This session will explore the use of Maps, App Engine, Go, Compute Engine, BigQuery, Cloud Storage, and WebGL to do massive data visualization. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "2319",
        "rating": 5,
        "title": "Google I/O 2013 - All the Ships in the World: Visualizing Data with Google Cloud and Maps",
        "id": "MT7cd4M9vzs"
    },
    "n8ep4leoN9A": {
        "speakers": [
            "Nat Duca",
            "Tom Wiltzius"
        ],
        "summary": "Animations and scrolling at 60FPS: difficult! Let's talk about rendering performance by way of a couple case studies. We'll cover the basic challenge of smooth animation, approaches to finding the bottleneck in your application using Dev Tools, and methods to cope with some common pitfalls. Topics include Dev Tools rendering features, subtleties of CSS animation, common cases that kill scrolling performance, and a peak into the hardware acceleration model that underpins Chrome's graphics pipeline. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "2654",
        "rating": 4.9365077,
        "title": "Google I/O 2013 - Jank Free: Chrome Rendering Performance",
        "id": "n8ep4leoN9A"
    },
    "n8hjjSzgRyw": {
        "speakers": [
            "Chris Wilson",
            "Daniels Lee"
        ],
        "summary": "Learn about the Google TV platform and the opportunity to build web apps for the platform using HTML5 or Flash. Session includes an overview of the platform, best practices, demos, and a discussion about the opportunities for developers to build killer apps for Google TV.",
        "viewCount": "14147",
        "rating": 5,
        "title": "Google I/O 2011: Building Web Apps for Google TV",
        "id": "n8hjjSzgRyw"
    },
    "N8SS-rUEZPg": {
        "speakers": [
            "Paul Irish",
            "Pavel Feldman"
        ],
        "summary": "You're an experienced web developer but new to Chrome Dev Tools' nuances? Get up to speed on all the newest features of a web app developer's best friend. Update CSS styles on the fly, get a diff or save changes to disk. Set breakpoints on everything imaginable and dig into the networking stack to uncover performance gains.",
        "viewCount": "69722",
        "rating": 4.971119,
        "title": "Google I/O 2011: Chrome Dev Tools Reloaded",
        "id": "N8SS-rUEZPg"
    },
    "N_mofJwgtJ4": {
        "speakers": [
            "Ian Barber"
        ],
        "summary": "Learn how Google+ Sign-In can co-exist with alternative social login solutions and how to migrate your apps from legacy Google authentication systems. If you already have social login on your site and are wondering how to add Google+ Sign-In, or are currently using an older OAuth 2.0 Google auth integration, this session is for you. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "151",
        "rating": 5,
        "title": "Google I/O 2013 - How to Offer Google+ Sign-In Alongside Other Social Sign-In Services",
        "id": "N_mofJwgtJ4"
    },
    "N_wTBKMuJis": {
        "speakers": [
            "Eric Bidelman"
        ],
        "summary": "The web continues to evolve at an accelerated rate. It's hard to keep up! This session will cover the bleeding-edge features of HTML5 that you may have missed, focusing on features that make developers' lives easier and apps more powerful. A heavy focus will be on freshly landed CSS/JS/HTML primitives which address layout, performance, and specific use cases..especially on mobile: @viewport, @supports, intrinsic/viewport units, resolution & pointer media queries, User/Resource Timing APIs, JS i18n API, iframe goodies, and more. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "427",
        "rating": 4.909091,
        "title": "Google I/O 2013 - A More Awesome Web: Features You've Always Wanted",
        "id": "N_wTBKMuJis"
    },
    "Naol_TPPPL0": {
        "speakers": [
            "Darin Fisher"
        ],
        "summary": "Learn about Google Chrome's multi-process architecture and sandboxing technology. This talk will provide an overview of the processes, threads, and IPC involved with getting pixels on the screen in a system where the WebKit rendering engine is denied, via the sandbox, from having direct access to your computer.  For presentation slides and all I/O sessions, please go to: code.google.com/events/io/sessions.html",
        "viewCount": "18243",
        "rating": 4.357143,
        "title": "Google I/O 2009 - Exploring Chrome Internals",
        "id": "Naol_TPPPL0"
    },
    "nb4gvrNrDWw": {
        "summary": "Learn how the Chrome Developer Tools can make development with the Maps API faster and easier. If you'd like to know more, see the links below. Chrome DevTools documentation:. http://goo.gl/UCVxD. Google Maps API V3 reference:. http://goo.gl/KkqNg. For more DevTools screencasts than you can handle:. http://www.html5rocks.com/en/slides#devtools. From the jQuery Docs:. 'jQuery() — which can also be written as $() — searches through the DOM for any matching elements and *creates a new jQuery object that references these elements*.'. http://api.jquery.com/jQuery/#jQuery1",
        "viewCount": "8569",
        "rating": 4.9448276,
        "title": "The Google Maps API and Chrome DevTools",
        "id": "nb4gvrNrDWw"
    },
    "nH3qrLzGRQU": {
        "speakers": [
            "Joe Beda",
            "Marc Cohen"
        ],
        "summary": "Learn tools and techniques to help you build rock solid, scalable, high performance, virtual computing clusters on Google Compute Engine. Topics we'll cover:. - summary of advanced tools (startup scripts, metadata server, service accounts, load balancing). - building and managing clusters. - storage options and tradeoffs (scratch disk vs. persistent disk vs. cloud storage, snapshots, hot swap PD). - dealing with outages (planned and unplanned). We'll conclude with a guided tour of a robust web service along with summary of best practices. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "577",
        "rating": 5,
        "title": "Google I/O 2013 - When Bad Things Happen to Good Clusters: Robust Systems with Google Compute Engine",
        "id": "nH3qrLzGRQU"
    },
    "NG42lu-GEbo": {
        "summary": "Now that you've got a handle on what Chrome Apps are and what they can do, we're going to build an app live, and dive into the new Windowing API to show you how you can completely configure the look and feel of your Chrome App window. We'll also explain more about Content Security Policy, and how it might affect your development. Remember, we want to hear from you! What are the APIs that you're most interested and excited about? Tell us at http://goo.gl/7ZQUN so we can cover the things you're most interested in first!. Be sure to add this event to your calendar and tune in next Tuesday!",
        "viewCount": "1811",
        "rating": 4.7777777,
        "title": "Chrome Apps Office Hours",
        "id": "NG42lu-GEbo"
    },
    "nK5VZ71qMIY": {
        "speakers": [
            "Brian Rakowski"
        ],
        "summary": "Video Footage from the Google Chrome Extensions launch event on 12/09/09.  In this part, Brian Rakowski, product management director, provides an update on Google Chrome and explains why extensions are important for the Google Chrome team.",
        "viewCount": "9560",
        "rating": 4.6666665,
        "title": "Google Chrome Extensions: Launch Event (part 1)",
        "id": "nK5VZ71qMIY"
    },
    "nn0_fQYQ2Qk": {
        "speakers": [
            "Jan Kleinert"
        ],
        "summary": "In this week's episode of Google Apps Script office hours, Jan and Arun:. - Introduce the Google Apps Script app that was recently published in the Chrome Web Store: https://chrome.google.com/webstore/detail/eoieeedlomnegifmaghhjnghhmcldobl. - Answer a variety of questions from the Google Moderator. - Answer live questions about UiApp, triggers, ScriptDb, and other topics. To find out when the next office hours will be held, visit https://developers.google.com/live/drive",
        "viewCount": "2032",
        "rating": 4.304348,
        "title": "Apps Script Office Hours - September 13, 2012",
        "id": "nn0_fQYQ2Qk"
    },
    "nOEw9iiopwI": {
        "speakers": [
            "Paul Irish"
        ],
        "summary": "In this video, Paul Irish, a Chrome developer advocate, presents 12 tips and tricks on how to use Chrome's developer tools. To learn more visit code.google.com/chrome/devtools",
        "viewCount": "122783",
        "rating": 4.972093,
        "title": "Google Chrome Developer Tools: 12 Tricks to Develop Quicker",
        "id": "nOEw9iiopwI"
    },
    "nP8Mo0jGQDk": {
        "speakers": [
            "Henry Bridge"
        ],
        "summary": "Henry Bridge, product manager for Native Client introduces the developer preview of Native Client's sdk. For more information go to http://code.google.com/p/nativeclient-sdk",
        "viewCount": "95242",
        "rating": 4.83871,
        "title": "Introducing the Native Client SDK",
        "id": "nP8Mo0jGQDk"
    },
    "nv0F0k6iDB8": {
        "speakers": [
            "Paul Kinlan"
        ],
        "summary": "Join host Paul Kinlan and the creators of Chrome Web Lab in the studio, as they dive into the technology and design behind Lab Tag Explorer. Discover the magic and learn about the science behind this experiment: http://www.chromeweblab.com/en-GB/lab-tag-explorer#tech.",
        "viewCount": "929",
        "rating": 5,
        "title": "GDL Presents Push the Limits: Chrome Web Lab, Lab Tag Explorer",
        "id": "nv0F0k6iDB8"
    },
    "O1YjdKh-rPg": {
        "speakers": [
            "Paul Kinlan",
            "James Hawkins"
        ],
        "summary": "Web Intents allows you to build applications that integrate with one another with an ease that has never been seen on the web before. In this session we will show you how to connect applications using Web Intents and how to best integrate with the many actions available in Web Intents such as editing, saving and sharing. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "4546",
        "rating": 4.8139534,
        "title": "Google I/O 2012 - How to Build Apps that Love Each Other with Web Intents",
        "id": "O1YjdKh-rPg"
    },
    "nyq4k_HC7lY": {
        "speakers": [
            "Susan Wojcicki"
        ],
        "summary": "Lightning talk by Susan Wojcicki, SVP of Advertising and Commerce at Google, at 7 Techmakers and a Microphone at Google I/O presented by Women Techmakers.",
        "viewCount": "553",
        "rating": 5,
        "title": "Google I/O 2013 - Susan Wojcicki - 7 Techmakers and a Microphone",
        "id": "nyq4k_HC7lY"
    },
    "o9Xo_WFAyqg": {
        "speakers": [
            "Dan Heberden",
            "Paul Irish"
        ],
        "summary": "Building web applications often means utilizing other libraries, frameworks, and plugins. Using a package manager to mange this greatly improves your productivity, enhances the speed and security of your application, and makes it much easier to stay up to date. Forget tracking new releases of libraries on blogs/Twitter, manually downloading dependent scripts, and managing the files and folders of libraries you use. With package management, keeping your dependencies updated and discovering new and related projects becomes straight-forward. In this session, we'll dive into the value of client-side package management and bring you up to speed with the open source package manager Bower, which offers a rich ecosystem of packages. Plus, learn about the useful integrations with Yeoman, Grunt, RequireJS, and NPM. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "788",
        "rating": 5,
        "title": "Google I/O 2013 - Clientside Package Management: Less Work, More Awesome",
        "id": "o9Xo_WFAyqg"
    },
    "ogumRA9LxR4": {
        "speakers": [
            "Paul Irish",
            "Hakim El Hattab"
        ],
        "summary": "Make Web Magic: The Minds Behind the Most Popular Chrome Experiments. Using the latest open web technologies, the developers creating some of the most inspired Chrome Experiments showcase their latest web experiments and discuss how they are making the web faster, more fun, and open in this 3-episode hangout. Host: Paul Irish, Developer Advocate, Chrome. Guest: Hakim El Hattab",
        "viewCount": "7908",
        "rating": 5,
        "title": "GDL Presents: Make Web Magic | Part III",
        "id": "ogumRA9LxR4"
    },
    "Oic22dQMRXQ": {
        "speakers": [
            "Jake Archibald",
            "Mark Christian",
            "Alex Russell",
            "Jonas Sicking",
            "Andrew Betts"
        ],
        "summary": "What's the right way to build offline into a web application? Despite wide support of technologies like appcache and web storage, solutions remain hackish. Why?. Panelists: Jake Archibald, Mark Christian, Alex Russell and Jonas Sicking. Moderator: Andrew Betts",
        "viewCount": "7556",
        "rating": 4.902439,
        "title": "Edge Conference - Panel 1: Offline",
        "id": "Oic22dQMRXQ"
    },
    "OJMH2pRaHgo": {
        "speakers": [
            "Megan Smith"
        ],
        "summary": "Megan Smith, Entrepreneur and Vice President of Google[X], sharing insights on need for visibility of technical women as she opens 7 Techmakers and a Microphone at Google IO presented Women Techmakers and Lightning talk by Kathy Kleiman, Founder of the ENIAC Programmers Project, sharing the history of the women pioneers of ENIAC.",
        "viewCount": "251",
        "rating": 5,
        "title": "Google I/O 2013 - Kathy Kleinman and Megan Smith - 7 Techmakers and a Microphone",
        "id": "OJMH2pRaHgo"
    },
    "OPfvnfnFuBs": {
        "speakers": [
            "Matt McNeill",
            "Tom Newton"
        ],
        "summary": "We'll look at how the Gamesys social MMORPG 'Here Be Monsters' utliizes the Google Cloud Platform as a production data warehouse for managing user engagement and automating retention activities using App Engine. We'll demo the game's integration with Google Spreadsheets and BigQuery via Google Apps Script and dive into the code that enables automated reporting dashboards and ad hoc game optimization. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "191",
        "rating": 5,
        "title": "Google I/O 2013 - Here Be BigQuery: Building Social Gaming Infrastructure on Google Cloud Platform",
        "id": "OPfvnfnFuBs"
    },
    "OXQsZSWBDDM": {
        "speakers": [
            "Pete LePage"
        ],
        "summary": "Join Pete LePage and the developers who built Movi Kanti Revo for a very special Chrome Office Hours. We'll take a look behind the divs to show you how the experiment was built, and how you can use some of these techniques in your own web design.",
        "viewCount": "8457",
        "rating": 4.818182,
        "title": "Chrome Office Hours: Movi Kanti Revo—Behind the Divs",
        "id": "OXQsZSWBDDM"
    },
    "p2HzZkd2A40": {
        "speakers": [
            "Justin Uberti",
            "Sam Dutton"
        ],
        "summary": "WebRTC implements open standards for realtime, plugin-free video, audio and data communication. The core WebRTC APIs getUserMedia, RTCPeerConnection and DataChannel â have now been implemented across Chrome and Firefox. In this session, we show you how to get started with building a WebRTC app:. - what's a MediaStream (aka getUserMedia) and how can I use it?. - resolution constraints. - signalling: what is it and how can I set it up?. - servers: what do I need?. - RTCPeerConnection: WebRTCs most powerful API. - RTCDataChannel: realtime communication of arbitrary data. - integrating WebRTC with Web Audio. - interoperability. - security. During the session, we talk through code examples, live demos and production apps. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "1799",
        "rating": 4.923077,
        "title": "Google I/O 2013 - Real-time communication with WebRTC",
        "id": "p2HzZkd2A40"
    },
    "P5YodNSX4jk": {
        "speakers": [
            "Andrei"
        ],
        "summary": "Rip open the box and start playing immediately. This tutorial will show you why we say that the Dart project comes with 'batteries included.' The Dart SDK includes all the tools you need to write, test, build, preview, and deploy your application. Learn how to customize your toolchain to analyze code, debug and inspect breakpoints, install and share packages, minify and concatenate source files, compile to JavaScript, generate Source Maps, integrate with continuous integration services, and deploy your app. Join Andrei as he shows you how Dart's rich tool ecosystem helps you create a fast-paced and developer-friendly workflow.",
        "viewCount": "1952",
        "rating": 4.826087,
        "title": "Batteries Included: The Dart Toolchain",
        "id": "P5YodNSX4jk"
    },
    "p6qhjI7PJ5A": {
        "speakers": [
            "Colt McAnlis"
        ],
        "summary": "We just launched our Udacity HTML5 Game Programming (CS255) Course and we're excited to talk to you about this on Google Developers Live! Join Colt, Sean, and Peter and special guest Sebastian Thrun (Udacity CEO) for an overview of the course and a live Q&A session. To sign up for the course, go to https://www.udacity.com/course/cs255",
        "viewCount": "17244",
        "rating": 4.858156,
        "title": "Udacity HTML5 Game Programming (CS255) Course Launch",
        "id": "p6qhjI7PJ5A"
    },
    "PAzY2MQxJDQ": {
        "speakers": [
            "Brad Green",
            "Erin Rosenthal"
        ],
        "summary": "Whether your users are blind, deaf, dyslexic, or simply driving a car, making apps accessible provides a richer experience for all. Using examples and demos, we'll give you an overview of what it means to make web and Android applications accessible. You'll see that accessible doesn't mean boring.",
        "viewCount": "6207",
        "rating": 4.7419353,
        "title": "Google I/O 2011: Accessibility: Building Products that Everyone Can Use",
        "id": "PAzY2MQxJDQ"
    },
    "peo0DZZWS10": {
        "speakers": [
            "Paul Kinlan"
        ],
        "summary": "Join host Paul Kinlan and the creators of Chrome Web Lab in the studio, as they dive into the technology and design behind Universal Orchestra. Discover the magic and learn about the science behind this experiment: http://www.chromeweblab.com/en-GB/universal-orchestra#tech.",
        "viewCount": "850",
        "rating": 5,
        "title": "GDL Presents Push the Limits: Chrome Web Lab, Universal Orchestra",
        "id": "peo0DZZWS10"
    },
    "Pgk0u4lBiGY": {
        "speakers": [
            "Mitchell Foley"
        ],
        "summary": "Discover the latest features of the Google Visualization API and master the new methods of creating elegant, data-driven charts. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "489",
        "rating": 5,
        "title": "Google I/O 2013 - Google Visualization API",
        "id": "Pgk0u4lBiGY"
    },
    "pmqKnEG-6GA": {
        "speakers": [
            "Boris Smus",
            "Eric Bidelman",
            "Paul Irish"
        ],
        "summary": "In this episode of HTML5Rocks Live, Boris, Eric and Paul join us to show some great new libraries and performance tips. Please leave your comments on our plus page at http://goo.gl/hDRzo. In the first chapter, Paul shows how to use some of Chrome's new developer tools to understand how things are rendering and get improved performance. In the second chapter (21:25), Boris shows off his new device.js library to help make development of mobile web applications and sites easier. Eric closes the hangout (40:00) and talks about his new file system API polyfill that uses indexed db as it's back end. 02:15 Scroll Effects Demo http://goo.gl/h3jy5. 23:04 - Media Queries Site http://goo.gl/rfQMa. 24:15 - WURFL http://goo.gl/a8Sam. 26:40 - Boris' Device Library http://goo.gl/yk9VK. 29:28 - Device.js Demo http://goo.gl/0Mg92. 33:25 - Bug to add touch-enabled media query to Chrome, please star http://goo.gl/1RXWs 35:00 - Chrome's DevTools for Mobile Development. 38:56 - Paul Irish's Touch Demos http://goo.gl/Obi45. 40:43 - File System API Book http://goo.gl/3hqfw 43:10 - Eric's idb.filesystem.js http://goo.gl/PVHRh. 44:27 - idb.filesystem HTML5 File System Demo http://goo.gl/QTxoj. 47:33 - HTML5 Filesystem Playground http://goo.gl/lYfEf",
        "viewCount": "15683",
        "rating": 4.7166667,
        "title": "HTML5Rocks Live, Episode 1",
        "id": "pmqKnEG-6GA"
    },
    "Prkyd5n0P7k": {
        "speakers": [
            "Colton McAnlis"
        ],
        "summary": "This session will present GRITS, a player vs. player shooter game, built entirely using Google technologies. In this talk, we'll walk through building an HTML5 canvas engine, serving the content, networking using Websockets, using NodeJS, social integration and more. Attendees to this session will walk away with a big-picture view of all the Google technologies that are relevant to web gaming, a deep understanding of how to get started with them, and have the ability to see them live, in action with the source code to the published game. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "36356",
        "rating": 4.8755555,
        "title": "Google I/O 2012 - GRITS: PvP Gaming with HTML5",
        "id": "Prkyd5n0P7k"
    },
    "PPXeWjWp-8Y": {
        "speakers": [
            "Addy Osmani",
            "Paul Irish"
        ],
        "summary": "Ask and vote for questions at: http://goo.gl/hLfF8. Addy Osmani and the (real) Paul Irish return for the second live episode of the Breakpoint - a new show focusing on developer tooling and workflow. This week they'll be showing us brand new SASS, feature inspection and console features in the Chrome Developer Tools. If you want your to stay on the bleeding edge of tooling, you won't want to miss it.",
        "viewCount": "14666",
        "rating": 4.959799,
        "title": "The Breakpoint Ep. 2: Chrome DevTools with Paul Irish and Addy Osmani",
        "id": "PPXeWjWp-8Y"
    },
    "pS8udLMOOaE": {
        "speakers": [
            "Stephen Konig",
            "Ilya Grigorik"
        ],
        "summary": "WebP is a new, open-source image format which provides lossy and lossless compression of images with significant byte savings: 30-80% smaller image files when compared to jpeg and png! In this session we will cover the latest features, news, and future roadmap of the WebP format. We will dive into a few hands-on case studies and recount how large sites and applications deployed WebP, the challenges they faced in the process, and the benefits they saw and measured after the migration. In other words, a 0-60 primer on WebP: what it is, how to get started, the tooling, and the benefits - bring your propeller hat!. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "948",
        "rating": 4.857143,
        "title": "Google I/O 2013 - WebP: Deploying Faster, Smaller, and More Beautiful Images",
        "id": "pS8udLMOOaE"
    },
    "pFK35DrsFY8": {
        "speakers": [
            "Frank Galligan",
            "John Luther"
        ],
        "summary": "Video is predicted to comprise 71 percent of all mobile data traffic by 2016 (Source: Cisco). Yet, surprisingly few people understand the formats that majority of that data traffic will use. In this session you will learn the skills required to encode or decode video in your application, with a focus on the royalty-free WebM format. You can find the code covered in the session here: https://code.google.com/p/webm/source/browse/?repo=bindings. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "2139",
        "rating": 5,
        "title": "Google I/O 2013 - Demystifying Video Encoding: WebM/VP8 for the Rest of Us",
        "id": "pFK35DrsFY8"
    },
    "PsVckBCOjv4": {
        "speakers": [
            "Jake Archibald",
            "Addy Osmani"
        ],
        "summary": "Jake Archibald and Addy Osmani take a dive in to Chrome Dev Tools for Mobile and show you how you can get the best out of Chrome for Mobile. Watch the actual show here: http://www.youtube.com/watch?v=jXqrgtm-yF8",
        "viewCount": "1016",
        "rating": 5,
        "title": "Mobile Web Thursdays: Dev Tools",
        "id": "PsVckBCOjv4"
    },
    "q_O9_C2ZjoA": {
        "speakers": [
            "Paul Irish"
        ],
        "summary": "Paul Irish, from the Chrome Developer Relations team, walks through smart techniques to improve the performance of your app. He describes CSS reflows and how to avoid them, hardware accelerated CSS, animation optimization, web workers, benchmarking and build scripts.",
        "viewCount": "60995",
        "rating": 4.953668,
        "title": "HTML5, CSS3, and DOM Performance",
        "id": "q_O9_C2ZjoA"
    },
    "QCij88i5_mg": {
        "speakers": [
            "Johanna Wright"
        ],
        "summary": "Lightning talk by Johanna Wright, VP of Mobile Search & Assist at Google, at 7 Techmakers and a Microphone at Google I/O presented by Women Techmakers.",
        "viewCount": "276",
        "rating": 5,
        "title": "Google I/O 2013 - Johanna Wright - 7 Techmakers and a Microphone",
        "id": "QCij88i5_mg"
    },
    "q6DJbAkjxss": {
        "speakers": [
            "Sam Dutton"
        ],
        "summary": "It is often thought that only the desktop web is a great medium for media. In this show Sam Dutton will show you some of the latest enhancements to the mobile web platform for Media. https://developers.google.com/live/shows/240787011/",
        "viewCount": "1292",
        "rating": 4.259259,
        "title": "Mobile Web Thursdays: Mobile Media",
        "id": "q6DJbAkjxss"
    },
    "QND2lFCrIGw": {
        "speakers": [
            "Dimitri Glazkov"
        ],
        "summary": "WebKit is at the heart of Chromium, Safari, and many other web browsers. Because we all share WebKit, the procedure for its development is a bit different than the rest of Chromium. Dimitri Glazkov gives a thorough introduction to WebKit for Chromium developers including productivity tips.",
        "viewCount": "8426",
        "rating": 4.483871,
        "title": "WebKit for Chromium Developers",
        "id": "QND2lFCrIGw"
    },
    "R281PhQufHo": {
        "summary": "(Pre-recorded GDC content). This talk will cover the nuances of porting your existing C++ game to Native Client. We'll talk about the application specific problems, how to deal with the Pepper Thread, along with platform APIs like FileIO, rendering and Audio. In addition we'll cover common issues with the Chrome Web store, distribution, and monetization. Finally, we'll be talking about exciting news and roadmaps for native client moving forward. If you're interested in NaCl, or want to learn more, this is the talk for you!. Speaker: Colt McAnlis",
        "viewCount": "10289",
        "rating": 4.96,
        "title": "GDC 2012: Porting your game to NaCl",
        "id": "R281PhQufHo"
    },
    "QviS1fSwAGA": {
        "speakers": [
            "Chris Wilson"
        ],
        "summary": "Join Chris Wilson in the second part of the Web Audio series.",
        "viewCount": "2541",
        "rating": 4.8095236,
        "title": "Web Audio Part 2 with Chris Wilson",
        "id": "QviS1fSwAGA"
    },
    "rbLkYlbEZ1E": {
        "speakers": [
            "Nicolas Geoffray"
        ],
        "summary": "Join dart2js engineer Nicolas Geoffray as he explains how the Dart to JavaScript translation benefits from global type inference. Learn more at http://www.dartlang.org",
        "viewCount": "3144",
        "rating": 5,
        "title": "Global Type Inference with Dart2js - Dartisans",
        "id": "rbLkYlbEZ1E"
    },
    "rNkfs8-uRTE": {
        "speakers": [
            "Antony Sargent"
        ],
        "summary": "Antony Sargent, a software engineer at Google discusses topics related to ids, packaging and distribution of extensions in the Google Chrome Extension system. To get more information, visit code.google.com/chrome/extensions",
        "viewCount": "59009",
        "rating": 4.7894735,
        "title": "Google Chrome Extensions: Identity, Signing and Auto Update",
        "id": "rNkfs8-uRTE"
    },
    "rQGjwsjtdwY": {
        "speakers": [
            "Paul Kinlan",
            "Pete LePage"
        ],
        "summary": "In this week's Chrome Apps Office Hours, +Paul Kinlan and +Pete LePage will discuss OAuth flow in Chrome packaged app and show a demo of how you can connect to Instagram and fetch a user's photo feed.",
        "viewCount": "1305",
        "rating": 5,
        "title": "Chrome Apps Office Hours - 3rd Party Authentication",
        "id": "rQGjwsjtdwY"
    },
    "RqsIPFPoQpQ": {
        "speakers": [
            "Jonathan Taylor",
            "Michael Galpin",
            "Prakash Hariramani"
        ],
        "summary": "One of the top barrier to mobile commerce is the ease of checkout. Whether you're selling office supplies, t-shirts, or fancy jewelry your users are faced with the same problem: providing credit card and shipping information via long complicated forms that are particularly painful to fill out on a mobile device. That's where the Google Wallet Android API comes in. Learn how you can use the API to make the shopping experience in your app simple and frictionless, and in turn drive up conversion and sales. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "261",
        "rating": 5,
        "title": "Google I/O 2013 - Selling physical goods on Android with Google Wallet Instant Buy",
        "id": "RqsIPFPoQpQ"
    },
    "RSBrSQRGdmA": {
        "speakers": [
            "Josh Ain",
            "Justin Boyan"
        ],
        "summary": "At Google, we're making more and more use of structured data to help users find your content. In addition to a variety of rich snippets that enhance search results, we're now showing event calendars for cities and venues, reviews for movies in the Knowledge Graph, ingredient filters for recipes, and more. How do you ensure your site is participating in features like these? We'll answer that question by demoing a suite of new and updated tools â including Data Highlighter and the Structured Data Dashboard â that make providing and validating your site's structured data easier than ever. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "235",
        "rating": 5,
        "title": "Google I/O 2013 - Hands-On: New Google Tools for Structured Data",
        "id": "RSBrSQRGdmA"
    },
    "rT-BxYLZdeY": {
        "summary": "We interviewed Box at the Google I/O Sandbox on May 11, 2011. They explained to us the benefits of integrating with the Chrome OS system. Box offers cloud-based content management for businesses and they recently unveiled a streamlined content upload process on the Chrome OS.   For more information about developing on Chrome, visit: http://code.google.com/chrome/  For more information on Box, visit: http://www.box.net",
        "viewCount": "2015",
        "rating": 5,
        "title": "Google I/O Sandbox Case Study: Box",
        "id": "rT-BxYLZdeY"
    },
    "s4zpL4VBbuU": {
        "speakers": [
            "Boris Smus"
        ],
        "summary": "Boris Smus demonstrates remote debugging in Chrome for Android Beta.",
        "viewCount": "45790",
        "rating": 4.779412,
        "title": "Chrome for Android Remote Debugging",
        "id": "s4zpL4VBbuU"
    },
    "S6kqTymOi7k": {
        "speakers": [
            "Christian Kurzke",
            "Paul Saxman"
        ],
        "summary": "In this talk, we will answer the question: How do you get your application into the living room?  First, we describe the different ways a developer can create an application for Google TV, from optimized Web pages to customized Android applications. Then, in the main part of the session we will focus on Android development and explain some of the unique features of developing for TV devices. After attending this session you will know some of the best practices how to develop Android applications for Google TV.",
        "viewCount": "8508",
        "rating": 4.368421,
        "title": "I/O BootCamp 2011: Google TV, the New Frontier for App Development",
        "id": "S6kqTymOi7k"
    },
    "SAqmR6bUy80": {
        "speakers": [
            "Balachandar Krishnamoorthy",
            "Clancy Childs",
            "Duncan Mckie",
            "Louis Collard"
        ],
        "summary": "Google Analytics and AdSense are two Google products that will soon be able to deliver their reporting data into BigQuery, Google's big data query and analysis engine. In this session, see how Google Analytics Premium and AdSense users are able to conduct advanced data analysis using BigQuery. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "323",
        "rating": 5,
        "title": "Google I/O 2013 - Google Analytics and AdSense Data Analysis in BigQuery",
        "id": "SAqmR6bUy80"
    },
    "SDaf7f9yl6E": {
        "speakers": [
            "Ellie Powers",
            "Miles Barr",
            "Riccardo Govoni"
        ],
        "summary": "Publishing a new application on Google Play is just the beginning -- you work constantly to update your app, improve user reviews, see what users are doing with your app, expand into new markets, and build a revenue stream. Join the team who brought you the new Developer Console to learn how Google Play is bringing you more data to optimize your application, better tools to distribute your application, and new ways to understand and connect with your users along every step of the journey. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "555",
        "rating": 5,
        "title": "Google I/O 2013 - What's new for Developers in Google Play",
        "id": "SDaf7f9yl6E"
    },
    "seX7jYI96GE": {
        "speakers": [
            "Alex Russell"
        ],
        "summary": "JavaScript remains one of the most popular and important programming languages in history. Web Developer and Chrome Engineer Alex Russell exposes the timeless strengths of the JavaScript language and why it is a vital part of the open web platform. Come hear what's next for the JavaScript standard and how to get the most out of the new features coming soon in V8 and Chrome.",
        "viewCount": "105585",
        "rating": 4.9529014,
        "title": "Google I/O 2011: Learning to Love JavaScript",
        "id": "seX7jYI96GE"
    },
    "SGcbzTKRXlc": {
        "speakers": [
            "Sam Dutton"
        ],
        "summary": "The recording the the weekly +Chrome Developer On Air Hangout. This week we invited two members of the WebRTC engineering team to join us and talk about what WebRTC has to offer",
        "viewCount": "7816",
        "rating": 4.780822,
        "title": "+Chrome Developers Hangout: WebRTC",
        "id": "SGcbzTKRXlc"
    },
    "SKGoBEhhWSU": {
        "speakers": [
            "Alex Danilo",
            "Alexis Deveria"
        ],
        "summary": "The future platform for reading is mobile. Creating a compelling digital magazine experience requires taking advantage of leading web platform features. CSS filters bring powerful creative control for content and now take advantage of GPUs on mobile devices. This session will cover content creation for state of the art digital documents explaining how these features work, best practices for performance, packaging for deployment and integration with other cutting edge CSS features. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "1556",
        "rating": 5,
        "title": "Google I/O 2013 - Stunning Mobile Visualization with CSS Filters",
        "id": "SKGoBEhhWSU"
    },
    "Sn_3rJaexKc": {
        "speakers": [
            "Andrew Bowers"
        ],
        "summary": "Learn about one of Google Web Toolkit 2.0's newest tools, Speed Tracer, in this video tutorial. This video provides an overview of Speed Tracer, a Chrome extension which enables developers to profile the internals of the browser, preventing bottlenecks by enabling diagnosis of hidden problems. Andrew Bowers will demonstrate how Speed Tracer is incorporated into the development cycle by walking through a Speed Tracer example.",
        "viewCount": "123265",
        "rating": 4.9310346,
        "title": "Speed Tracer Tutorial",
        "id": "Sn_3rJaexKc"
    },
    "soupCDgrREY": {
        "speakers": [
            "Boris Smus"
        ],
        "summary": "Join Boris Smus and members of the Chrome for Android engineering team to talk about what's new with the recent launch of Chrome For Android!",
        "viewCount": "7591",
        "rating": 4.7777777,
        "title": "+Chrome Developers Hangout: Chrome for Android",
        "id": "soupCDgrREY"
    },
    "SoxbKQpUzqc": {
        "speakers": [
            "Haisoo Shin",
            "John Stuppy",
            "Jon Boekenoogen"
        ],
        "summary": "Building a mobile commerce Android app isn't just a matter of putting pictures of your products in a ListView and adding a buy button. More so than any other type of mobile apps, time is money. The longer you make a user wait or the more time you make them spend filling out forms will decrease the chance of the user finishing their transaction. Plus whenever you're talking about accepting payments, you must think about security as well. Learn some of the techniques and tips from the Google Wallet team and from one of our partner on how you can make your mobile commerce apps easier and more secure to use, and thus increase your conversions and ultimately your bottom line. This session will include some intermediate/advanced Android development topics. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "635",
        "rating": 5,
        "title": "Google I/O 2013 - Building Compelling mCommerce Experiences on Android",
        "id": "SoxbKQpUzqc"
    },
    "SVPJcw5-WNc": {
        "summary": "Join us on Wednesday November 14th for our Monthly Mobile Web Hangout! This month Brad Frost will be joining us to talk about responsive design versus separate mobile sites. Although the US presidential race is already decided, the candidates spent a lot of time intensely debating the country's hot-button issues. The web design world is entrenched in our own debate about how to address the mobile web: should we create a separate mobile site or create a responsive experience instead?. It just so happens that the two US presidential candidates have picked different mobile web strategies for their official websites. In the red corner is Republican candidate Mitt Romney's dedicated mobile site, while in the blue corner is incumbent president Barack Obama's responsive website. Sit back, crack open a cold one, and watch the battle unfold as Brad dissect the candidates' sites to uncover best practices and common mobile web pitfalls.",
        "viewCount": "5615",
        "rating": 4.9591837,
        "title": "Chrome Mobile Monthly: Responsive vs Separate Sites",
        "id": "SVPJcw5-WNc"
    },
    "t1fOAKHTKoM": {
        "speakers": [
            "Pamela Fox",
            "Paul Irish"
        ],
        "summary": " In an ideal world, we would always use feature detection to decide what features to serve our users. Unfortunately, in the real world, there are practical problems with that approach, especially when facing users on mobile devices where you need to evaluate their runtime capabilities while you're serving assets. In this talk, I'll introduce the ideas and tools behind feature detection and then discuss our experiences with detecting the edge of the web at Coursera. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "394",
        "rating": 4.5555553,
        "title": "Google I/O 2013 - Feature Detection in the Real World",
        "id": "t1fOAKHTKoM"
    },
    "TAxy4q3RP_s": {
        "summary": "Learn about what's new in the latest Chrome for Android Beta release!",
        "viewCount": "4149",
        "rating": 4.733333,
        "title": "Mobile Web Thursdays: What's New in Chrome for Android Beta",
        "id": "TAxy4q3RP_s"
    },
    "TcaWEk2O3CM": {
        "speakers": [
            "Eric Bidelman"
        ],
        "summary": "What does it mean to install a web app? This session will give an overview of how to build a beautiful application for the Chrome Web Store, monetize, and distribute it to 70 million users!",
        "viewCount": "2734",
        "rating": 4.5555553,
        "title": "GDD-BR 2010 [2G] So What's A Web App? Introduction to the Chrome Web Store",
        "id": "TcaWEk2O3CM"
    },
    "TdPqPUkXJ8E": {
        "summary": "Head Shots is fun game where you play dodge ball against your friends. It uses the experimental WebRTC feature available in Chrome for Android, which provides peer data connection. To enable this feature, open chrome://flags in Chrome, click the Enable WebRTC option, then restart Chrome. Try it out here: http://headshots.leftlogic.com",
        "viewCount": "2062",
        "rating": 4.733333,
        "title": "Head Shots - a Chrome Experiment for Android",
        "id": "TdPqPUkXJ8E"
    },
    "TEwpppxgZhM": {
        "speakers": [
            "Pete LePage"
        ],
        "summary": "After this, developers who've submitted their app for review and have been selected will come on stage and start walking through their apps. They must be developers who are already attending Google IO, and who have apps published in Google Play Apps. The Android UX team and the guests speakers will critique the designs and propose improvements. We will work together with the usual designers' tools: whiteboards and pen. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "2081",
        "rating": 5,
        "title": "Google I/O 2012 - Upgrading Your Web App to a Chrome App",
        "id": "TEwpppxgZhM"
    },
    "tiXXeAkywrM": {
        "summary": "Today we'll review Neutron Drive, a web-based code editor for Google Drive that is available on the Chrome Web Store: http://goo.gl/MT5Eu",
        "viewCount": "2499",
        "rating": 4.625,
        "title": "Google Drive App Review: Neutron Drive",
        "id": "tiXXeAkywrM"
    },
    "TlJob8K_OwE": {
        "speakers": [
            "Darin Fisher",
            "Eric Seidel"
        ],
        "summary": "Answers to the top questions (listed with timecodes here http://chromium.org/blink/developer-faq#TOC-Q-A-Video) asked by the developer community about Blink. Engineering leads Darin Fisher and Eric Seidel are joined by PM Alex Komoroske and Developer Advocate Paul Irish.",
        "viewCount": "24690",
        "rating": 4.894737,
        "title": "Blink Questions Answered",
        "id": "TlJob8K_OwE"
    },
    "tmzxMO9lrF0": {
        "speakers": [
            "Paul Kinlan",
            "Paul Lewis",
            "Pete LePage",
            "Renato Dias"
        ],
        "summary": "Ask and vote for questions: http://goo.gl/MRYZG. You spoke, we listened. Join Paul Kinlan, Paul Lewis, Pete LePage, and Renato Dias to learn about the new storage APIs that are available to Chrome Packaged Apps in the next installment of Chrome Apps Office Hours. We'll take a look at the new sync-able and local storage APIs as well as other ways you can save data locally on your users machine. We didn't get through quite as many questions as we hoped last week, and are going to dedicate some extra time this week, so be sure to post your questions on Moderator below!",
        "viewCount": "1799",
        "rating": 4.6923075,
        "title": "Chrome Apps Office Hours: Chrome Storage APIs",
        "id": "tmzxMO9lrF0"
    },
    "u-7uyuTxQ5E": {
        "speakers": [
            "Florence Thng",
            "Vishay Nihalani"
        ],
        "summary": "You've spent many long hours working on your app, but how do you turn those long days and nights into many users and plentiful revenue? Find out what's new with AdMob, and how it can be your partner in building a great app business. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "712",
        "rating": 5,
        "title": "Google I/O 2013 - Build a Great App Business with AdMob",
        "id": "u-7uyuTxQ5E"
    },
    "tVpofTGsWeg": {
        "summary": "Building for mobile web requires a different mindset than desktop web development, and a different set of tools. The tools we're used to using often aren't available or would take up too much screen real estate. And going back to the dark ages of tweak/save/deploy/test/repeat isn't exactly optimal, so what can we do? Thankfully there are a number of great options - from remote debugging to emulation, mobile browsers are offering more and more tools to make our lives easier. We'll take a look at a couple of tools that you can use today to make cross platform mobile web development easier and then peer into the crystal ball to see what tools may bring in the future. Join us for Part 2 - as we take a look at a some of the many tools to make testing the mobile web easier.",
        "viewCount": "1102",
        "rating": 4.68,
        "title": "Chrome Mobile: The Mobile Web Developers Toolkit (Part 2)",
        "id": "tVpofTGsWeg"
    },
    "uGTm6_KbG-g": {
        "summary": "In this video, you can get information on the Chrome Web Store's licensing API. To learn more on web apps and the Chrome Web Store please visit code.google.com/chrome/apps and code.google.com/chrome/webstore respectively.",
        "viewCount": "11596",
        "rating": 4.794872,
        "title": "Integrating with the Licensing API",
        "id": "uGTm6_KbG-g"
    },
    "UC9LwtA_MC8": {
        "speakers": [
            "Jeff Chang"
        ],
        "summary": "An open forum for the Chrome/OS teams to discuss the web platform and take questions. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "3211",
        "rating": 4.7894735,
        "title": "Google I/O 2012 - Chrome/OS Fireside Chat",
        "id": "UC9LwtA_MC8"
    },
    "Ul-LbfkJ-tw": {
        "speakers": [
            "Bhaskar Janakiraman",
            "Daniel Kurka",
            "Ray Cromwell"
        ],
        "summary": "At Google I/O 2012, Google handed over control of GWT to the community through the GWT Steering Committee. Now, one year later, come see what the exciting future of GWT will look like, as the GWT Steering Committee presents its future roadmap for GWT. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "1779",
        "rating": 4.927273,
        "title": "Google I/O 2013 - GWT Roadmap for the Future",
        "id": "Ul-LbfkJ-tw"
    },
    "UPkozTArSEs": {
        "speakers": [
            "Chris Wilson",
            "Louis Gray"
        ],
        "summary": "Chris Wilson talks to host Louis Gray about Open Web Platform, specifically Web Audio. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "854",
        "rating": 4.7894735,
        "title": "Google Developers Live at I/O 2013 - Web Audio",
        "id": "UPkozTArSEs"
    },
    "urGK3ZZ8Rs0": {
        "speakers": [
            "Paul Kinlan"
        ],
        "summary": "Join host Paul Kinlan and the creators of Chrome Web Lab in the studio, as they dive into the technology and design behind Data Tracer. Discover the magic and learn about the science behind this experiment: http://www.chromeweblab.com/en-GB/data-tracer#tech.",
        "viewCount": "1814",
        "rating": 4.714286,
        "title": "GDL Presents Push the Limits: Chrome Web Lab, Data Tracer",
        "id": "urGK3ZZ8Rs0"
    },
    "UUnC5y4j0As": {
        "speakers": [
            "Christian Stefansen"
        ],
        "summary": "In this video, Christian Stefansen, product manager for Native Client, presents the most common use cases for the technology. To learn more about Native Client visit www.gonacl.com",
        "viewCount": "26808",
        "rating": 4.757576,
        "title": "Native Client: When to use the technology",
        "id": "UUnC5y4j0As"
    },
    "uzBw6AWCBpU": {
        "speakers": [
            "Jason Sams",
            "Tim Murray"
        ],
        "summary": "RenderScript is an API for high-performance computation on Android using whatever processors are available on a device, including CPUs, GPUs, DSPs, and more. This talk will cover how to develop applications with RenderScript that are capable of running on any device running Gingerbread or greater. We will walk you through accelerating a simple application and show how we can provide high performance on different architectures with a single source base. Benchmarks comparing RS to the NDK will be presented. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "672",
        "rating": 5,
        "title": "Google I/O 2013 - High Performance Applications with RenderScript",
        "id": "uzBw6AWCBpU"
    },
    "v5jgUimpFnw": {
        "speakers": [
            "Ajay Guwalani",
            "Ankur Jain"
        ],
        "summary": "In this talk, we will discuss what we are doing for our enterprise admins and developers to provide them a much better way of building tools and applications. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "209",
        "rating": 5,
        "title": "Google I/O 2013 - Introducing a New Way to Administer Businesses on Google",
        "id": "v5jgUimpFnw"
    },
    "v6qNeml4y0g": {
        "speakers": [
            "Alexis Hanicotte",
            "Chris Elliott",
            "Olivier Michon"
        ],
        "summary": "From indie to AAA game studios, learn how cutting edge developers are building next generation experiences on the Google Cloud Platform. This session focuses on how developers are combining technologies such as App Engine, Compute Engine, and BigQuery to quickly build and scale their multi-platform releases. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "1199",
        "rating": 5,
        "title": "Google I/O 2013 - Intense Gaming",
        "id": "v6qNeml4y0g"
    },
    "v9TG7OzsZqQ": {
        "speakers": [
            "Brad Abrams",
            "Ido Green"
        ],
        "summary": "This talk discusses the latest and greatest application patterns and toolset for building cutting edge HTML5 applications that are backed by App Engine. This makes it incredibly easy to write an app that spans client and server; in particular, authentication just works out of the box. This talk walks through building a fantastic cloud-based HTML5 application. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "10211",
        "rating": 4.9534883,
        "title": "Google I/O 2012 - HTML5 and App Engine: The Epic Tag Team Take on Modern Web Apps at Scale",
        "id": "v9TG7OzsZqQ"
    },
    "vdMBihN28NI": {
        "summary": "Alarms API",
        "viewCount": "777",
        "rating": 4.7647057,
        "title": "Chrome Apps Office Hours: Alarms API",
        "id": "vdMBihN28NI"
    },
    "vFacaBinGZ0": {
        "summary": "Modern workflows for modern webapps. http://yeoman.io",
        "viewCount": "41453",
        "rating": 4.865772,
        "title": "Introduction to Yeoman",
        "id": "vFacaBinGZ0"
    },
    "vHowRlkImzk": {
        "speakers": [
            "Paul Irish",
            "Mark Danks"
        ],
        "summary": "Using the latest open web technologies, the developers creating some of the most inspired Chrome Experiments showcase their latest web experiments and discuss how they are making the web faster, more fun, and open in this 3-episode hangout. Host: Paul Irish, Developer Advocate, Chrome. Guest: Mark Danks",
        "viewCount": "888",
        "rating": 4.733333,
        "title": "GDL Presents: Make Web Magic | Part II",
        "id": "vHowRlkImzk"
    },
    "VIBOCVY0Hvg": {
        "speakers": [
            "Matthew Papakipos"
        ],
        "summary": "Google's HTML 5 Work: What's Next? For those who are attending Google I/O 2009(http://code.google.com/io/), these video are an opportunity to hear from some of the speakers in advance. The speakers introduce their topic and provide a preview of one or more topics that will be covered in their talks.  Learn about new features in HTML 5 that enhance and enrich the web experience. Learn about new features in HTML 5, how they'll be supported in Chrome, and our latest plans for new functionality. The web browser is quickly evolving into a rich platform with access to all the capabilities that your computer has to offer. This talk will help you understand what is possible and how to write applications that use the latest APIs.",
        "viewCount": "6067",
        "rating": 3.909091,
        "title": "Matt Papakipos - Google's HTML 5 Work: What's Next?",
        "id": "VIBOCVY0Hvg"
    },
    "VhpdsjBUS3g": {
        "speakers": [
            "John Mccutchan"
        ],
        "summary": "Take advantage of the lessons learned by the developers of Find Your Way to Oz. Getting that last ounce of performance from your application takes careful optimization that can only be done with an understanding of the runtime environment. Learn how to dig into V8 and surface the important signals that you need to effectively optimize your program. Use these signals to find where small code changes can have large impacts on performance!. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "1184",
        "rating": 5,
        "title": "Google I/O 2013 - Accelerating Oz with V8: Follow the Yellow Brick Road to JavaScript Performance",
        "id": "VhpdsjBUS3g"
    },
    "vnXb1S6l_jE": {
        "summary": "This is a video that shows you how to upload your app to the Chrome Web Store. To learn more on the Chrome Web Store please visit code.google.com/chrome/apps or code.google.com/chrome/webstore",
        "viewCount": "25545",
        "rating": 4.780822,
        "title": "How to upload your app to the Chrome Web Store",
        "id": "vnXb1S6l_jE"
    },
    "VOf27ez_Hvg": {
        "speakers": [
            "Rajeev Dayal"
        ],
        "summary": "Follow along as we present a history of the GWT project, the exciting new features in the GWT 2.5 release, and where we plan to take GWT in the future. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "15588",
        "rating": 4.8832116,
        "title": "Google I/O 2012 - The History and Future of Google Web Toolkit",
        "id": "VOf27ez_Hvg"
    },
    "VQLdm8BY1Ao": {
        "summary": "Dart Editor, part of the open-source Dart project, is a light weight and productive editor for Dart. It can help developers editor, refactor, and debug Dart apps. Watch this video to learn more about Dart Editor and its many features to help developers be more productive building high performance web apps.",
        "viewCount": "15790",
        "rating": 4.811321,
        "title": "How to use Dart Editor",
        "id": "VQLdm8BY1Ao"
    },
    "VYtW5K8Lbhg": {
        "speakers": [
            "Vic Fryzel",
            "Claudio Cherubino"
        ],
        "summary": "Vic Fryzel and Claudio Cherubino of the Google Drive Developer Relations team review Desmos, a Drive-integrated graphing application. They walk through the Desmos user experience from installation from the Chrome Web Store to saving files in Google Drive, offering observations on how Desmos has taken advantage of the Drive API and SDK and suggesting some areas for potential improvement.",
        "viewCount": "3792",
        "rating": 4.3846154,
        "title": "Google Drive App Review: Desmos",
        "id": "VYtW5K8Lbhg"
    },
    "w4eiUiauo2w": {
        "speakers": [
            "John Luther",
            "Jeff Posnick"
        ],
        "summary": "On this week's show, special guest John Luther, the Product Manager responsible for the WebM video container format and VP8 video codec, joins Jeff Posnick for a chat about all things WebM. You'll learn about how YouTube's using WebM (and how you could use it too) for both consumption and video creation, as well as hear about some exciting advances in video encoding that are in the pipeline.",
        "viewCount": "2922",
        "rating": 4.904762,
        "title": "YouTube Developers Live: WebM",
        "id": "w4eiUiauo2w"
    },
    "w67HK_KM7UA": {
        "speakers": [
            "Peter Lubbers",
            "Alex Komoroske",
            "Scott Rowe"
        ],
        "summary": "Ask and vote for questions: http://goo.gl/dQKnd. Join Peter Lubbers, Alex Komoroske, and Scott Rowe as they explain what Web Platform Docs is all about and how you can contribute. See: http://www.webplatform.org/",
        "viewCount": "7292",
        "rating": 4.6363635,
        "title": "Introduction to Web Platform Docs",
        "id": "w67HK_KM7UA"
    },
    "WEBeNZ8khS4": {
        "speakers": [
            "Alex Komoroske",
            "Darin Fisher",
            "Eric Seidel",
            "Max Heinritz",
            "Paul Irish"
        ],
        "summary": "Meet the team behind Blink, Chrome's new open-source rendering engine. We'll give a brief overview of Blink from the inside; among other things, what's happened since our April launch, some of our future plans, and how we ensure interoperability across browsers. Most of the session will be reserved for your questions about Blink, feature development, and the web platform. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "1190",
        "rating": 5,
        "title": "Google I/O 2013 - Fireside Chat with the Blink Team",
        "id": "WEBeNZ8khS4"
    },
    "WhZpKdQcKhU": {
        "speakers": [
            "George Crawford",
            "Razvan Caliman",
            "Andy Hume",
            "Amber Weinberg"
        ],
        "summary": "Why are some designs easy to implement and others almost impossible? Can we make it easier to do magazine style column layout, fitted wrapping or embedding sandboxed content? For those aiming for truly responsive design, are variables like CPU power, viewing distance, input interface and pixel density just as important as viewport-width?. Panelists: George Crawford, Razvan Caliman, Andy Hume. Moderator: Amber Weinberg",
        "viewCount": "3538",
        "rating": 4.4666667,
        "title": "Edge Conference - Panel 4: Responsive Layout",
        "id": "WhZpKdQcKhU"
    },
    "WP3N1bgjiek": {
        "speakers": [
            "Alex Russell"
        ],
        "summary": "In this video Alex Russell, a software engineer from the Chrome Frame team describes how a web developer / web master can start using Google Chrome Frame. To learn more visit code.google.com/chrome/chromeframe.",
        "viewCount": "51102",
        "rating": 4.759036,
        "title": "Using Google Chrome Frame",
        "id": "WP3N1bgjiek"
    },
    "WpqZ0LjNU5A": {
        "speakers": [
            "Paul Irish",
            "Addy Osmani"
        ],
        "summary": "Ask and vote for questions at: http://goo.gl/dxF0X. The DevTools' Timeline shows the heartbeat and health of your application's performance. In this episode we'll do a deep deep dive into how to uncover the cost of internal browser operations like parsing HTML, decoding images, invalidating layout geometry and painting to screen. Paul and Addy will show you how best to approach improving the performance of your CSS and JS.",
        "viewCount": "6502",
        "rating": 4.9444447,
        "title": "The Breakpoint Ep. 4 —The Tour De Timeline",
        "id": "WpqZ0LjNU5A"
    },
    "wRDPTnY3yO8": {
        "speakers": [
            "Karen Teng"
        ],
        "summary": "Karen Teng, VP Engineering of Adaptive Blue (www.getglue.com), discusses her company's experience with the Google Chrome extensions platform.  To learn more on creating Google Chrome Extensions please visit code.google.com/chrome/extensions or check out the gallery at chrome.google.com/extensions.",
        "viewCount": "55515",
        "rating": 4.757576,
        "title": "Google Chrome Extensions Developer Snapshots - Glue",
        "id": "wRDPTnY3yO8"
    },
    "wSEMg29QVmo": {
        "summary": "You may have heard about Chrome Apps recently and now's your opportunity to learn more. We'll do a short recap of Chrome Apps and what they can do, and then answer your questions!'",
        "viewCount": "6904",
        "rating": 4.652174,
        "title": "Introduction to Chrome Apps",
        "id": "wSEMg29QVmo"
    },
    "WsvNebq1dRg": {
        "speakers": [
            "Ben Goodger"
        ],
        "summary": "Ben Goodger presents a brief introduction of the Chromium views system used to build UI on Windows. This talk covers the basics of using views, as well as some details about how it works under the hood.",
        "viewCount": "6480",
        "rating": 3.7142856,
        "title": "Chromium UI Development",
        "id": "WsvNebq1dRg"
    },
    "WWYz71WOrPg": {
        "speakers": [
            "Brian Birtles",
            "Dmitri Baranovskiy"
        ],
        "summary": "Find out all about the new animation specification being developed for the web. We hosted special guests Brian Birtles from Mozilla, Dmitri Baranovskiy from Adobe plus a few more. Learn where this is going and how you can use it today in your favorite browser.",
        "viewCount": "318",
        "rating": 4.111111,
        "title": "WebAnimations",
        "id": "WWYz71WOrPg"
    },
    "x6qe_kVaBpg": {
        "speakers": [
            "Paul Irish",
            "Pavel Feldman"
        ],
        "summary": "As the complexity of the web apps you build keeps moving, so do the Chrome DevTools. We'll give you the latest update on your favorite companion; explore new features like emulating mobile devices, remote debugging, Canvas and WebGL profiling, Sass preprocessor support, developing completely within Chrome using the new Workspaces support, and 20 other features that are brand-new to you and will hugely improve your development. Also, learn how to profile and improve your #1 enemy to scrolling performance: paint. Emulate mobile devices within Chrome DevTools with simulated touch events and geolocation data. You'll walk out of the session with a huge advantage in productivity, speed, and precision when developing, debugging, and improving your web applications. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "4299",
        "rating": 5,
        "title": "Google I/O 2013 - Chrome DevTools Revolutions 2013",
        "id": "x6qe_kVaBpg"
    },
    "x9Jlu_h_Lyw": {
        "speakers": [
            "John Mccutchan",
            "Loreena Lee"
        ],
        "summary": "Automatic garbage collection in JavaScript isn't a substitute for effective memory management, especially in large, long-running web apps. Memory leaks, frequent garbage collection pauses, and overall memory bloat can really drag you down. Come take a trip down memory lane with us and learn how we tackled these performance issues in Gmail. We'll share best practices for memory management and demonstrate how to use the Chrome DevTools Heap Profiler like a wizard to optimize your site. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "2197",
        "rating": 5,
        "title": "Google I/O 2013 - A Trip Down Memory Lane with Gmail and DevTools",
        "id": "x9Jlu_h_Lyw"
    },
    "x9KOS1VQgqQ": {
        "speakers": [
            "Mike West"
        ],
        "summary": "Chrome's extension system offers developers more opportunities than ever to customize and enhance users' experience on the web. New APIs are landing on a regular basis that provide new functionality and deeper hooks into Chrome itself. Join us for a walk through bleeding edge changes to Chrome's extension framework that increase security, improve performance, and make it easier than ever for users to get up and running with the product of your hard work. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "5331",
        "rating": 5,
        "title": "Google I/O 2012 - What's Next for Chrome Extensions?",
        "id": "x9KOS1VQgqQ"
    },
    "X_ek1wSe66o": {
        "speakers": [
            "Eric Bidelman"
        ],
        "summary": "The web is changing so quickly that it's hard to keep up with what's new in the platform. HTML5's new capabilities allow developers to build a whole new suite of applications - things that were once impossible to do, are now a reality. This session will walk you down the bleeding edge of HTML5 for 2012 by focusing on in-depth techniques, which solve real world challenges. We'll cover media capture, file I/O, advanced usage of websockets, media streaming, device input, multimedia, and modern css design. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "149762",
        "rating": 4.9168,
        "title": "Google I/O 2012 - The Web Can Do That!?",
        "id": "X_ek1wSe66o"
    },
    "XAqIpGU8ZZk": {
        "speakers": [
            "Lilli Thompson"
        ],
        "summary": "(Pre-recorded GDC content). Cutting-edge HTML5 brings high performance console-style 3d games to the browser, but developing a modern HTML5 game engine can be a challenge. Adapting to HTML5 and Javascript can be bewildering to game programmers coming from C / C++. This talk is an overview of the tools, techniques, and topics you need to be familiar with to adapt to programming high performance 3D games for the web. Topics will include cutting edge HTML5 APIs, writing high performance Javascript, and profiling / debugging tools. Speaker: Lilli Thompson",
        "viewCount": "35514",
        "rating": 4.9506173,
        "title": "GDC 2012: From Console to Chrome",
        "id": "XAqIpGU8ZZk"
    },
    "Xe8W5w68BRg": {
        "speakers": [
            "Neil Rhodes",
            "Russell Ketchum"
        ],
        "summary": "Ever want to make a small tweak to your mobile application but your users have already downloaded your app? Ever forget to add analytics on a key event until it's too late? Learn about new ways to dynamically configure your mobile applications server-side. You can hone your app for various audiences, and you'll never get caught by old versions or forgetfulness again. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "340",
        "rating": 5,
        "title": "Google I/O 2013 - Dynamically Configure Mobile Applications: Google Tag Manager for Mobile Apps",
        "id": "Xe8W5w68BRg"
    },
    "XMYVSIUfu2I": {
        "speakers": [
            "Andraz Tori"
        ],
        "summary": "Andraz Tori, founder and CTO of Zemanta (www.zemanta.com) discusses his company's experience with the Google Chrome extensions platform.  To learn more on creating Google Chrome Extensions please visit code.google.com/chrome/extensions or chek out the gallery at chrome.google.com/extensions.",
        "viewCount": "4002",
        "rating": 4.6,
        "title": "Google Chrome Extensions Developer Snapshots - Zemanta",
        "id": "XMYVSIUfu2I"
    },
    "y_1M0ilLoZU": {
        "speakers": [
            "Eric Bidelman",
            "Jan Kleinert"
        ],
        "summary": "Eric and Jan from the Apps Script Developer Relations team host another weekly edition of office hours, a chance for developers to ask their questions live or just chat about new features. This week they also highlighted some apps in the Chrome Web Store built on Apps Script: DriveEye, Gmail Meter, Gmail Print All for Chrome, and Drive Forms. To find out when the next office hours are scheduled visit: https://developers.google.com/live/drive",
        "viewCount": "1057",
        "rating": 4.304348,
        "title": "App Script Office Hours - August 16, 2012",
        "id": "y_1M0ilLoZU"
    },
    "ybXVRYWqN6s": {
        "speakers": [
            "Jonah Jones",
            "Yatin Chawathe"
        ],
        "summary": "The lead UX Designer and the Engineering Director for Google Maps will be covering technical and design considerations around creating the rich experiences of Google Maps, including deep dives into several innovative features. This talk will offer a rare insight into the thinking and challenges behind the scenes of the leading online mapping service. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "339",
        "rating": 5,
        "title": "Google I/O 2013 - Behind the scenes of Google Maps",
        "id": "ybXVRYWqN6s"
    },
    "yd30Nmb3mPU": {
        "speakers": [
            "Ernest Delgado",
            "Pete LePage"
        ],
        "summary": "HTML5 is more than just a pretty logo; it's a solid foundation upon which you can build web apps that meet or exceed user expectations for native apps. Here, we'll detail key features such as CSS3, graphics, offline, storage and more in Chrome and other modern browsers. We'll walk you step-by-step through new and exciting APIs you'll need to construct your own cutting-edge web applications.",
        "viewCount": "8734",
        "rating": 4.7391305,
        "title": "I/O BootCamp 2011: Getting Started with HTML5",
        "id": "yd30Nmb3mPU"
    },
    "ydbp2uDOTBE": {
        "speakers": [
            "Caterina Fake",
            "Slava Rubin",
            "Mary Lou Jepsen",
            "Julia Hartz",
            "Mary Grove"
        ],
        "summary": "The road to success includes many lessons learned along the way. From idea to exit, this panel of star studded founders share insights on how they tackled key challenges from product development to hiring and all the things they wish they would have known on the path to building innovative tech companies. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "1181",
        "rating": 5,
        "title": "Google I/O 2013 - Lessons from Founders",
        "id": "ydbp2uDOTBE"
    },
    "yO-TfKT2O_4": {
        "summary": "Your browser is one of the most and best instrumented development platforms -- you may just not realize it yet. In this episode we'll cover the Audit and Panel extension API's, take a deep dive into the Chrome debugging protocol (and what you can do with it), peek inside the Chrome's network stack, and finally go deep into the guts of Chrome with chrome://tracing!",
        "viewCount": "3722",
        "rating": 5,
        "title": "Extending Chrome DevTools for fun and profit..",
        "id": "yO-TfKT2O_4"
    },
    "yj0abkBz2Ag": {
        "summary": "A Look at Find Your Way To Oz",
        "viewCount": "2361",
        "rating": 4.822222,
        "title": "Behind the div's: A Look at Find Your Way To Oz",
        "id": "yj0abkBz2Ag"
    },
    "yQ3wgPP7PWY": {
        "speakers": [
            "Bob Meese",
            "Ibrahim Elbouchikhi"
        ],
        "summary": "Many commercially successful apps and games on Google Play share common attributes, including compelling application features, buyer profiles, and business models. In this session, we'll share what Google and developer partners have done to create successful monetization recipes. We'll also share our plans for further strengthening monetization on Google Play. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "903",
        "rating": 5,
        "title": "Google I/O 2013 - Making Money on Google Play",
        "id": "yQ3wgPP7PWY"
    },
    "yS7SkQXISz8": {
        "summary": "Building for mobile web requires a different mindset than desktop web development, and a different set of tools. The tools we're used to using often aren't available or would take up too much screen real estate. And going back to the dark ages of tweak/save/deploy/test/repeat isn't exactly optimal, so what can we do? Thankfully there are a number of great options - from remote debugging to emulation, mobile browsers are offering more and more tools to make our lives easier. We'll take a look at a couple of tools that you can use today to make cross platform mobile web development easier and then peer into the crystal ball to see what tools may bring in the future. Join us for Part 1 - as we take a look at a few boiler plates, frameworks and helpful libraries for building the mobile web.",
        "viewCount": "3972",
        "rating": 4.9569893,
        "title": "Chrome Mobile: The Mobile Web Developers Toolkit (Part 1)",
        "id": "yS7SkQXISz8"
    },
    "ytJKdipILiU": {
        "speakers": [
            "Brian Leroux",
            "Diana Cheng",
            "Paul Kinlan",
            "Petro Soininen",
            "Chris Heilmann"
        ],
        "summary": "Slowly, websites have been peeking outside the browser sandbox, though we remain some way off an interoperable solution for the holy grail of a website-as-desktop-app without any runtime other than the browser. How do we get there more quickly, and in the meantime navigate problems like conflicting and confusing user permission prompts, testing and updating, and do we get the access we actually need?. Panelists: Brian Leroux, Diana Cheng, Paul Kinlan, Petro Soininen. Moderator: Chris Heilmann",
        "viewCount": "1259",
        "rating": 5,
        "title": "Edge Conference - Panel 6: Privileged access",
        "id": "ytJKdipILiU"
    },
    "YtrGx8g88y8": {
        "speakers": [
            "Ido Green",
            "Danny Hermes"
        ],
        "summary": "Ready to rock the world with your next application? Odds are you are thinking about mobile, web and the cloud. In this session we will walk through building a modern mobile web application that takes advantage of the Google Cloud Platform. Learn trips, best practices and solid architecture that will make your next mobile web app an amazing success. This video contains the demo only. For the presentation visit: http://www.youtube.com/watch?v=6_oO9Gwf_do. Slides: https://picturesque-app.appspot.com/slides. Application: https://picturesque-app.appspot.com",
        "viewCount": "808",
        "rating": 5,
        "title": "Mobile, Web and Cloud - The Triple Crown of Modern Applications - Demo",
        "id": "YtrGx8g88y8"
    },
    "YxogQGnMA9Y": {
        "speakers": [
            "Dan Grove",
            "Vijay Menon"
        ],
        "summary": "Do you want to build blazingly fast applications with beautiful graphics and offline support? Would you like to run those apps anywhere on the open web? Would you like to develop those apps in a language that supports modular large-scale development while keeping the lightweight feel of a scripting language? This session will show you how to use the Dart programming language to develop the next generation of amazing applications for the open web. For all I/O 2012 sessions, go to https://developers.google.com/io/",
        "viewCount": "8479",
        "rating": 4.6825395,
        "title": "Google I/O 2012 - Putting the App Back into Web App - Web Programming with Dart",
        "id": "YxogQGnMA9Y"
    },
    "YyWu9HB9QtU": {
        "speakers": [
            "Charles Chen",
            "David Tseng",
            "Volker Sorge"
        ],
        "summary": "Comprehending and navigating complex web pages is difficult already for readers with perfect eyesight, but much harder when relying on speech rendering only. The ChromeVox screen reader is specifically built to handle modern web content in all its richness. ChromeVox is Javascript-based and makes it easy for developers to make cutting-edge web applications accessible. We demonstrate the latest incarnation of ChromeVox that offers advanced navigation facilities for complex content such as tables and mathematical formulas as well as support for Braille and new HTML5 UI controls such as date/time, and media controls. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "629",
        "rating": 4.6,
        "title": "Google I/O 2013 - Advancing Web Accessibility with ChromeVox",
        "id": "YyWu9HB9QtU"
    },
    "z2exxj4COhU": {
        "speakers": [
            "Alex Faaborg"
        ],
        "summary": "This session will provide an in-depth look at human perception and cognition, and its implications for interactive and visual design. The human brain is purely treated as an information processing machine, and we will teach the audience its attributes, its advantages, its limitations, and generally how to hack it. While the content will provide a deep review of recent cognitive science research, everything presented will also be grounded in example design work taken from a range of Google applications and platforms. Specific topics will include: edge detection, gestalt laws of grouping, peripheral vision, geons and object recognition, facial recognition, color deficiencies, change blindness, flow, attention, cognitive load balancing, and the perception of time. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "4570",
        "rating": 4.9325843,
        "title": "Google I/O 2013 - Cognitive Science and Design",
        "id": "z2exxj4COhU"
    },
    "z9h5_-NcMiQ": {
        "speakers": [
            "Peter Lubbers"
        ],
        "summary": "Ask and vote for questions at http://goo.gl/V5xDt. Is there anything you want to know about WebSocket? Now is your chance. Today, Peter Lubbers will be interviewing Vanessa Wang, Peter Moskovits, and Frank Salim — the authors of the new book 'The Definitive Guide to WebSocket' (Apress). They will talk about the new book, show some cool demos, and answer all your questions!",
        "viewCount": "2671",
        "rating": 4.9333334,
        "title": "Ask the Authors: The Definitive Guide to WebSocket",
        "id": "z9h5_-NcMiQ"
    },
    "zH5bJSG0DZk": {
        "summary": "Can't make it to the Google Developers house at SXSW? Don't worry, we've got you covered with a live stream of the exciting, demo-loaded lightning talks where you'll learn about the latest Google developer product hotness. Come watch what happens as we stream live from the Google Developers house in Austin, while a rain storm engulfs the city!  Here is the schedule of talks:  1) Holo: Exploring the design of the Android user interface 2) The next gen of Social Apps is in a Hangout: introducing Google+ Hangout Apps 3) The VJ in Your Pocket: Mobile YouTube API Apps for Content Creators, Curators and Consumers 4) Cloud adventures: Instant scale.. from zero to millions of hits in 24 hours 5) HTML5's Bleeding Edge 6) Beautiful Maps: enhancing geographic information with HTML5  You can learn more about the lightning talks and speakers at: http://www.google.com/events/sxsw/interactive/developers/",
        "viewCount": "52542",
        "rating": 4.7818184,
        "title": "Google Developers SXSW Lightning Talks",
        "id": "zH5bJSG0DZk"
    },
    "ZhDb42M6ZLk": {
        "speakers": [
            "Wan-Teh Chang",
            "Eric Roman"
        ],
        "summary": "Recently, Chromium's network stack was completely re-written. Wan-Teh Chang and Eric Roman present the reasons for the re-write, an overview of the code's components, and walk through some common network stack operations.",
        "viewCount": "5680",
        "rating": 4.5,
        "title": "Chromium's Network Stack",
        "id": "ZhDb42M6ZLk"
    },
    "ZhHSd59qNcQ": {
        "summary": "Ignite captures the best of geek culture in a series of five-minute speed presentations. Each speaker gets 20 slides that auto-advance after 15 seconds. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "1254",
        "rating": 5,
        "title": "Google I/O 2013 - IGNITE",
        "id": "ZhHSd59qNcQ"
    },
    "ZNiB7kcPqhE": {
        "speakers": [
            "Deborah Salmi"
        ],
        "summary": "Deborah Salmi, CMO of WOT (www.mywot.com) discusses her company's experience with the Google Chrome extensions platform.  To learn more on creating Google Chrome Extensions please visit code.google.com/chrome/extensions or chek out the gallery at chrome.google.com/extensions.",
        "viewCount": "6781",
        "rating": 4.111111,
        "title": "Google Chrome Extensions Developer Snapshots - Web of Trust",
        "id": "ZNiB7kcPqhE"
    },
    "zuaQkfMAsyI": {
        "speakers": [
            "Louis Gray",
            "Daniel Sieberg"
        ],
        "summary": "Join hosts Louis Gray and Daniel Sieberg as they recap the keynote announcements and preview what you can expect to see from Google Developers Live at Moscone Center. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "81",
        "rating": 5,
        "title": "Google Developers Live at I/O 2013 - Welcome to Day 1",
        "id": "zuaQkfMAsyI"
    },
    "zvLoHr1aKbQ": {
        "speakers": [
            "Don Dodge",
            "Heidi Roizen",
            "Jessica Livingston",
            "Naval Ravikant"
        ],
        "summary": "Have an idea and want to start a company? Learn how to attract investors, and what they want to see before writing a check. Hear from entrepreneurs who have raised money and VCs who have funded them. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "505",
        "rating": 4.5555553,
        "title": "Google I/O 2013 - How to Go from Weekend Hack to Funded Startup",
        "id": "zvLoHr1aKbQ"
    },
    "ZwFQcKD320w": {
        "speakers": [
            "Wolff",
            "Jonathan"
        ],
        "summary": "Here's another video from a previous session of our office hours. Watch this video to learn about the Hangouts Apps launch from +Wolff and +Jonathan. Discuss this video on Google+: http://goo.gl/d2cms. 3:31 - Publishing your hangout app. 4:28 - Hangout applications vs extensions. 8:00 - The application switcher. 9:58 - On the terms of service, privacy policy and support contact fields. 12:07 - OAuth client and hangout apps featuring the API console. 15:50 - Registering as a Chrome web store developer. 17:44 - Linking to your hangout. 20:25 - The hangout button. 24:33 - How data URIs can make things easier in your apps. Q&A. 29:00 - What's the status of the REST APIs?. 30:41 - How do I set the hangout topic or title?. 31:19 - How do those of us in other time zones know when your office hours will be held?. 34:04 - Can I use the hangout button with other peoples' hangout apps?",
        "viewCount": "2895",
        "rating": 3.7586207,
        "title": "Google+ Platform Office Hours for March 28, 2012: Hangouts API v1.0",
        "id": "ZwFQcKD320w"
    },
    "ZV_BIGmpfF8": {
        "speakers": [
            "Chris Wilson",
            "Jan Linden"
        ],
        "summary": "In part one of a two-part series about Web Audio, Chris Wilson, Jan Linden, and other Web Audio experts will show you how to use Web Audio and answer your questions. Moderator link to ask your questions: http://goo.gl/4T4Uz",
        "viewCount": "4303",
        "rating": 4.8153844,
        "title": "Chrome Developers: Web Audio (Part 1)",
        "id": "ZV_BIGmpfF8"
    },
    "zxuA-wyajhY": {
        "speakers": [
            "Matt Caruana Galizia",
            "Maired Buchan",
            "Francois Doust",
            "Boris Smus",
            "Pete LePage"
        ],
        "summary": "How do we write web apps that are agnostic to different input technologies? What about devices that combine touch and mouse, and what of new interaction methods like remote controls, speech and 3D gestures? What problems do we encounter when we expand support to encompass embedded browsers in devices like kiosks, TVs, games consoles, in-flight and in-car screens?. Panelists: Matt Caruana Galizia, Maired Buchan, Francois Doust, Boris Smus. Moderator: Pete LePage",
        "viewCount": "1479",
        "rating": 3.9333334,
        "title": "Edge Conference - Panel 5: Input",
        "id": "zxuA-wyajhY"
    },
    "zxwsOueJU4Q": {
        "speakers": [
            "Brian Dorsey",
            "Chris Ramsdale",
            "Julia Ferraioli",
            "Mike Miller",
            "Tyler Hannan",
            "Will Shulman"
        ],
        "summary": " Whether you're building a game, a mobile app, or a social analytics service, your information needs to be highly available, stored safely, and able to grow as your user base explodes. Come to this session to learn how modern distributed databases address these needs. You'll hear from a panel of four industry experts about their solutions for tackling this problem using Google's infrastructure and have the opportunity to ask the panel questions about their experiences. For all I/O 2013 sessions, go to https://developers.google.com/live",
        "viewCount": "370",
        "rating": 5,
        "title": "Google I/O 2013 - Distributed Databases Panel: An Exploration of Approaches and Best Practices",
        "id": "zxwsOueJU4Q"
    }
}
